{"id":"Bond_Loves_Boca","templateName":"Interview_Question_Highlights","heading":"Bond Loves Boca","type":"interview","category":"Shop Talk","issue":"February 2015","sourceURL":"article\/2015\/02\/Bond_Loves_Boca","previousURL":"article\/2015\/02\/Designer_Dossier","nextURL":"article\/2015\/02\/2_new_fragrances_to_try_from_Bond_No_9_creator_Laurice_Rahme","year":"2015","month":"02","subcategory":"Style","subheading":"It's like a little piece of jewelry. When this bottle is empty, then it becomes a collector's item.","authorDetails":"<p><em>by<\/em> Heather Carney<\/p>\r\n","summary":"<p>Bond No. 9 creator, Laurice Rahmé, tells us about the signature fragrance she dreamed up just for Boca, available exclusively at Saks Fifth Avenue, Boca Raton.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/ShopTalk.jpg"],"description":"<p><strong>Q: What is your connection to Boca?<\/strong><\/p>\r\n\r\n<p>A: My connection with Boca is one with New York. I've been coming here for seven years now. It always shocked me to see that the clients from here are my clients from New York. They're visiting parents, or they're retired from there. Most are New Yorkers. I do NYC neighborhoods [for my other fragrances]. I figured, why not do New York in Boca?<\/p>\r\n\r\n<p><strong>Q: Tell us about the fragrance titled Bond Loves Boca?<\/strong><\/p>\r\n\r\n<p>A: It's the third scent for Boca. It's in a purple bottle — men love it, women love it. The scent is also unique … the wood and the rose. [They like] the idea of mixing flowers with the woody notes that men like, and there's musk all the way at the bottom. I made it very powerful and strong. When I did this scent, I created it just how I would for New York.<\/p>\r\n\r\n<p><strong>Q: Tell us about the design of the bottle?<\/strong><\/p>\r\n\r\n<p>A: There are 200 Swarovski stones. The bottles are hand numbered. The collectors love it. It's like a little piece of jewelry. When this bottle is empty, then it becomes a collector's item.<\/p>\r\n\r\n<p><strong>Q: How would you describe the Boca man and woman?<\/strong><\/p>\r\n\r\n<p>A: They're a relaxed New Yorker. It's a more peaceful space and area. People have more time to spend talking to me — they can share with me what they like and don't like about the fragrance. They're New Yorkers with time on their hands.<\/p>\r\n\r\n<p><strong>Q: How do you create fragrances that can work for both men and women?<\/strong><\/p>\r\n\r\n<p>A: I have to be careful to balance the notes of the fragrance and use ingredients that men and women like. I have 50 fragrances and 20 are unisex. They have to be pleasing to both customers.<\/p>\r\n"}