{"id":"Busy_Bee","templateName":"Interview_Profile_Template1","heading":"Busy Bee","type":"interview","category":"Featured Profiles","issue":"February 2015","sourceURL":"article\/2015\/02\/Busy_Bee","previousURL":"article\/2015\/02\/OUI_PARIS","nextURL":"article\/2015\/02\/Standing_Tall","year":"2015","month":"02","subcategory":"Benjamin Oppenheimer","authorDetails":"<p><em>by<\/em> Tina Ashchian<em>Photography by<\/em> Jason Nuttle<\/p>\r\n","summary":"<p>Nine-year-old beekeeper Benjamin Oppenheimer is creating a buzz with his yummy honey in Boca Raton.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/BenjaminOppenheimer3643.jpg"],"description":"<p>Benjamin “Ben” Oppenheimer is an expert when it comes to honeybees. His eyes light up as he watches “The Waggle Dance of the Honeybee” on YouTube. Yes, something as specific as the way bees move, or “dance,” intrigues him. He spends hours online doing research. He studies his hive and the bees occupying it. He takes high-resolution photographs of them. He also collects honey and beeswax.<\/p>\r\n\r\n<p>At beekeeper workshops, he is among the mingling adults sharing their tips. He also enjoys sharing his knowledge with his classmates. Ben, 9, of Boca Raton, is a holder of an apiary – or beekeeping – license.<\/p>\r\n\r\n<p>“When someone asks me how many pets do I have, I say 30,003,” he laughs. That includes his two dogs, a rat named Ninja and 30,000 honeybees that visit his beehive in his parent's backyard.<\/p>\r\n\r\n<p>One day in the spring of 2012, Ben received sunflower seeds from church and decided to grow them. But when his sunflowers wouldn't ripen, he researched how to attract bees to help with pollination. That's when his obsession began. Two Christmases ago, Ben received a beehive from Santa.<\/p>\r\n\r\n<p>The hive, which now resembles a yellow, three-drawer night stand, houses 24 wooden frames of gradual honey and beeswax deposits. Once a month, Ben collects about four quarts of honey from his hive, which has passed state inspection. His secret-ingredient honey, which sells out quickly among neighbors and friends, won him third place in the novice category for best tasting honey at the University of Florida's Annual Bee College Welsh Honey Judging Show in August.<\/p>\r\n\r\n<p>Luckily Ben, the youngest member of the Palm Beach County Beekeepers Association, isn't afraid of or allergic to bees. He has been stung twice, even though he dresses in a full protective suit and knee-high boots – both of which are too large for his size – with a smoker (used to calm bees), bucket and spatula tool in hand.<\/p>\r\n\r\n<p>Ask him about his scariest encounter and he'll describe a time when he dropped a frame full of bees. “It wasn't too bad, but I felt bad for them,” says the Grandview Preparatory School third grader. Ben aspires to be a dentist or an architect, but bees will always be in his future. He has plans to split half of his hive, have them reproduce and then raise two hives.<\/p>\r\n\r\n<p>As for the neighbors, they are actually thankful for the local buzz. One neighbor says eating Ben's honey helps with her allergies. Another neighbor couldn't grow avocados for three years until Ben started caring for the bees. Now Ben receives avocados in exchange for honey.<\/p>\r\n\r\n<p>“He has managed it very well. We haven't had a lot of issues. We even traveled for a month this past summer and [the] bees were just fine,” his mother says.<\/p>\r\n\r\n<p>His parents, Missy Pierce Oppenheimer and Jeffrey Oppenheimer, grew to welcome their son's hobby. His mother even takes to lifting the frames when they become too heavy with honey.<\/p>\r\n\r\n<p>In fact, the family has become so used to it, that they even drove from Homestead to Boca Raton with bees loose in their hybrid car when they escaped from a new bee box. After not one sting, the family decided to pull into a fast food drive-thru while the car behind them started honking and yelling repeatedly, “You have bees in your car!” But that didn't alarm the Oppenheimers.<\/p>\r\n\r\n<p>Now the family is moving to another home in Boca Raton with the bees in tow. Ben learned of a new, strategic way to transport the hive. This time, he says, he is confident that they won't escape again.<\/p>\r\n"}