{"id":"Designer_Dossier","templateName":"Interview_Questions","heading":"Designer Dossier","type":"interview","category":"Fashion","issue":"February 2015","sourceURL":"article\/2015\/02\/Designer_Dossier","previousURL":"article\/2015\/02\/Your_floors_Our_passion","nextURL":"article\/2015\/02\/Bond_Loves_Boca","year":"2015","month":"02","subcategory":"Jewelry Design\u2029\u2029\u2029","subheading":"Alexis Bittar","authorDetails":"<p><em>By<\/em> Aly Zofcin<\/p>\r\n","summary":"<p>Alexis Bittar, 46, has come a long way from selling his antique-inspired jewelry to having his designs featured in stores like Neiman Marcus, and worn by celebrities like Madonna to Broadway stars, such as NeNe Leakes. Bittar designs for four of his own lines, collaborates with other designers and organizations, and recently launched his “Fine” collection.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/AlexisBittar.jpg"],"description":"<p><strong>Q: When did you first realize you had a fascination with antique jewelry?<\/strong><\/p>\r\n\r\n<p>I realized that I had a love for antique jewelry when I was probably, I want to say, 8 or 9 years old. There was an antique jeweler in Maine, her name was Mrs. Ivers, she had cotton blue candy hair, and she was an old-school Mainer. She was an antique collector\/dealer and she gave me my first piece of jewelry, which was a wedding band, weirdly enough.<\/p>\r\n\r\n<p><strong>Q: What was the moment when you realized you wanted to be a jewelry designer?<\/strong><\/p>\r\n\r\n<p>I was selling antique jewelry from 13 to 22, and at 22, I got a little frustrated buying antique jewelry and trying to find [antique jewelry] with a curated eye. I decided to start to design and tap into that well from within.<\/p>\r\n\r\n<p><strong>Q: When was the moment you realized you had finally made it?<\/strong><\/p>\r\n\r\n<p>Designing Burberry in '99, getting the cover of French Vogue, getting the cover of Italian Vogue, being in Bergdorf, being in Barneys, being in Neiman – all of these are big moments. Celebrities, you know, being worn by Rihanna, doing a movie with Madonna. There are so many different layers of moments. Even with all those little moments, I think winning the CFDA actually was the moment, which was not too long ago in 2010. Being nominated by your peers, both editors and designers ... I was up against Marc Jacobs and Proenza Schouler, so it was kind of tough competition. To feel that in accessories, I was recognized, it made me feel like I had made it, actually.<\/p>\r\n\r\n<p><img class=\"nowrap\" src=\"\/projectflip-frontend\/projectflipadmin\/sites\/default\/files\/articles\/description\/images\/AlexisBittar2.jpg\" \/><\/p>\r\n\r\n<p><strong>Q: What is it like to collaborate with other designers?<\/strong><\/p>\r\n\r\n<p>Usually I tend to be a little myopic and my perception gets very narrow. When you work with another designer ... it's like two meteors hitting each other. It's an explosion of sorts. Hopefully it's a creative one.<\/p>\r\n\r\n<p><strong>Q: What inspires you the most?<\/strong><\/p>\r\n\r\n<p>I have four lines, so fortunately each of the lines has a distinct personality and I'm able to channel these different muses in these different collections, like Miss Havisham, Lucite, Elements, and now the Fine [collection]. I'm always layering in the past eras and then thinking and pushing everything into the future. There's a real respect for classic sensibility, and at the same time wanting to design into the future – modernity.<\/p>\r\n\r\n<p><strong>Q: What do you think of when you hear Florida?<\/strong><\/p>\r\n\r\n<p>I have designed with [Florida] in mind before. It has a historic reference for me, it's very late '60s, early '70s. I spent my childhood down here then, because my grandparents lived here. When I think of this very late '60s-, early '70s-like bouffant hair with this really glamorous, beach weather – I think of Malibu and I think of Florida.<\/p>\r\n"}