{"id":"February_2015_McCormick_Place","templateName":"Publisher_Letter","heading":"February 2015 - McCormick Place","type":"interview","category":"McCormick Place","issue":"February 2015","sourceURL":"article\/2015\/02\/February_2015_McCormick_Place","previousURL":"article\/2015\/02\/Ocean_Blue_Yacht_Sales","nextURL":"2015\/02\/index.php","year":"2015","month":"02","authorDetails":"<p><em>By<\/em> Bernard McCormick<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/bernardmccormickfeb2015.jpg"],"description":"<p>Nolen approached the car on the passenger's side. Gibbons went to the driver's side. They moved cautiously, shining their flashlights on the occupants. They directed the lights in the car, checking the back seats and the floors for weapons. They saw nothing. “OK,” Nolen said. “Get out.”<\/p>\r\n\r\n<p>As soon as the man on the passenger's side reached for the door handle, Nolen knew it was coming. He did not reach with his right hand, the hand next to the door, but reached across with his left, and as he did Nolen saw his right go down between the seat and the door and the light of the flashlight caught the .38 revolver as it came up.<\/p>\r\n\r\n<p>Nolen jumped back. He knew that if the man was going to shoot, he would get off the first shot before Nolen could reach his own pistol. But he was surprised at how quickly the shot came. He had just time to turn his head toward Tommy Gibbons and shout, “Look out Tom!” when he heard the explosion and felt the bullet tear into his face.”<\/p>\r\n\r\n<p>An excerpt from The New York Times magazine, Oct. 18, 1970<\/p>\r\n\r\n<p>Sometimes this might be called plagiarism, but not when you are quoting yourself. In the summer of 1970 we were already planning to leave Philadelphia magazine for Florida when The New York Times called our editor and wanted a writer to report on the low crime rate in Philadelphia. The editor asked us if we were interested. Sure. There's only one New York Times. We were barely into the story, however, when the assignment changed. There had been two incidents on the same weekend of police getting shot in West Philadelphia. One man died and over the weekend, six were wounded. The above excerpt describes the shooting of two police officers, John Nolen and Tommy Gibbons. The other event – an attack on a guardhouse of the Fairmount Park Guard – looked, at first, like a terrorist plot. A story on Philadelphia's low crime rate would look silly under the circumstances. This was the time of the Black Panthers and The Times wanted to know if a war on the cops was breaking out. The police commissioner was the notoriously tough Frank Rizzo, widely thought to be a racist, and Philadelphia's response to the violence against police promised drama.<\/p>\r\n\r\n<p>As it turned out, the police shootings were just a coincidence. The guardhouse attack was a low-level conspiracy, but there was no widespread plot out there. But it took weeks for that to become apparent, and by then we had spent time with Philadelphia's elite highway patrol, riding with one of the toughest men in that tough unit – a white man, of course. These were men who thrived on danger. The man I rode with had been in a 15-minute fight with a guy who got his gun away from him, stabbed him in the face and only gave up when the patrolman managed to shoot him during the wrestling contest. He had a police brutality complaint on that one. The cop, 24 years old, had ulcers and was particularly sensitive to being hit in the stomach. His district was almost all black, and this man had unusual sensitivity to its problems. He said most of the people were great, and wished more white people got to know the good black people. He felt sorry for the way so many lived, their houses practically fortresses for protection against some of their neighbors.<\/p>\r\n\r\n<p>We saw in a few days things that have made us sympathetic to police these last 45 years. Calls of “man with a gun” sent our guy racing through dark city streets hoping to be the first cop on the scene. The drive turned out to be the wildest part of the event. We learned that such calls were sometimes false, designed to attract all available police to a location while the bad guys did their work in the vacated zones. And we got the feeling when they encountered drug pushers – our man could smell dope a mile away – that at any moment a shooting might start. The bad guys would think us a plainclothes cop. We actually began feeling like one, except more nervous that any real cop would be. Once, our guy frisked a suspect and handed us plastic packets for safekeeping. He was thinking we might be useful in court. In the light of the shootings of New York police recently, and the general hostility in the black community toward law enforcement, our story from decades back seems poignant. Little has changed.<\/p>\r\n\r\n<p>Nobody got shot at during our brief tour as a fake cop, and our New York Times story wound up being much about the shooting of John Nolen and Tommy Gibbons. Gibbons was a natural cop. His father had been Philadelphia's police commissioner. Both men survived, and were vivid in their recollections of the night. Nolen's bullet to the face would have killed him except, in turning to warn Gibbons, he presented a miraculous angle, for the bullet went through the side of his mouth and out an ear. Despite being shot, Nolen managed to wound his fleeing assailant, which soon led to his arrest. Gibbons was struck twice and one wound led to complications that caused him to retire on disability. He then became an admired police reporter. And the story that never ran on Philadelphia's low crime rate would have been bogus. The statistics – it was revealed much later – were phony. The city was as dangerous as any place else.<\/p>\r\n\r\n<p>Twenty, maybe twenty-five years later we got a call from Gibbons. He had been down at police headquarters and showed some of his old buddies the New York Times piece. “It sounded like you were there,” he said. We weren't there, but Gibbons sure was, and that was good enough for The New York Times.<\/p>\r\n"}