{"id":"Five_simple_Tips","templateName":"Simple_Collection_Template1","heading":"Five simple Tips","type":"simple_collections","category":"Health & Fitness","issue":"February 2015","sourceURL":"article\/2015\/02\/Five_simple_Tips","previousURL":"article\/2015\/02\/VIANNA_BRASIL","nextURL":"article\/2015\/02\/Design_NS","year":"2015","month":"02","subheading":"To Live a Healthy Life","authorDetails":"<p><em>By<\/em> Briana Dodson<\/p>\r\n","summary":"<p>There are plenty of fad diets and trends to staying in shape, but being healthy doesn't have to be so difficult. Here are five simple tips to living a long, healthy life.<\/p>\r\n","itemscollection":[{"headline":"1. Never skip breakfast.","description":"<p>While some assume cutting back on food or eliminating an entire meal may help with weight loss, it can be a recipe for disaster, or more specifically, heart disease. According to a study by the Harvard School of Public Health, those who skip breakfast are more likely to have issues with obesity, high blood pressure and high cholesterol, which are precursors to heart disease. Source: Harvard School of Public Health, hsph.harvard.edu<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/breakfast.jpg"}]},{"headline":"2. Schedule regular check-ups.","description":"<p>Regular examinations are an important way to identify early signs of disease or problems in the body. By making that yearly visit, a doctor is able to catch and diagnose problems early, preventing issues from getting too serious. If diseases are caught early enough, treatment is usually more effective. Source: Everyday Health, everydayhealth.com<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/CheckUps.jpg"}]},{"headline":"3. Manage stress.","description":"<p>Having a positive mental outlook and attitude on life proves to ease the mind, which in the long run puts less stress on your body. Taking time to relax alone is very important, as well as maintaining a healthy balance between work, fun and home. At the end of the day, remember to get seven to eight hours of sleep in order to feel refreshed for the next day. Source: Centers for Disease Control and Prevention, cdc.gov<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/ManageStress.jpg"}]},{"headline":"4. Maintain a healthy weight.","description":"<p>Knowing how many calories to consume each day, including food and drinks, is a great way to maintain a healthy weight. Avoid eating more calories than your body has the ability to burn and don't eat until feeling uncomfortably full. Source: American Heart Association, heart.org<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/HealthyWeight.jpg"}]},{"headline":"5. Be more active.","description":"<p>Aim to be active for at least 2.5 hours per week with activities that increase heart rate and breathing, while strengthening the body's muscles. Physical activity can also reduce high blood pressure, high cholesterol and allow the body to remain at a healthy weight. Source: Centers for Disease Control and Prevention, cdc.gov<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/Exercise.jpg"}]}]}