{"id":"Five_MustKnows_Before_Visiting_The_New_John_Barrett_Salon","templateName":"Interview_Template4","heading":"Five Must-Knows Before Visiting The New John Barrett Salon","type":"interview","category":"Beauty","issue":"February 2015","sourceURL":"article\/2015\/02\/Five_MustKnows_Before_Visiting_The_New_John_Barrett_Salon","previousURL":"article\/2015\/02\/Quinoa_Salad","nextURL":"article\/2015\/02\/Your_best_foot_forward","year":"2015","month":"02","subcategory":"John barrett salon","authorDetails":"<p><em>By<\/em> Alyssa Morlacci<\/p>\r\n","summary":"<p>After nearly two decades operating his Manhattan salon on the ninth floor of Bergdorf Goodman, John Barrett plans to expand his brand to new locations across the country in New York, Dallas, Las Vegas and Washington, D.C. But first on his list: Palm Beach<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/JBImage2.jpg"],"description":"<p>The new John Barrett salon, which sits on the corner of Peruvian and Hibiscus avenues, boasts a complete beauty and retail experience. “It is going to be the jewel box of Palm Beach,” Barrett says of the 3,200-square-foot property. “There will be no competition as far as beauty is concerned.” At press time, the salon was scheduled to celebrate its official grand opening in late January.<\/p>\r\n\r\n<p>Here's what you need to know before scheduling your first appointment:<\/p>\r\n\r\n<p><strong>On the owner\/founder:<\/strong><\/p>\r\n\r\n<p>Originally from Ireland, Barrett lived in London and Los Angeles before arriving in New York in the early 1990s. In 1996, Bergdorf Goodman selected Barrett as the stylist to open his now-famous New York salon in the department store. Since, he's styled celebrities and politicians alike. He's met with clients such as Katie Holmes, Beyonce and Hillary Clinton on Fifth Avenue, and he's made personal calls to their homes and the homes of many Palm Beachers. So many, in fact, that he purchased an apartment on Worth Avenue.<\/p>\r\n\r\n<p><img class=\"nowrap\" src=\"\/projectflip-frontend\/projectflipadmin\/sites\/default\/files\/articles\/description\/images\/johnBarrett_0332.jpg\" \/><\/p>\r\n\r\n<p><strong>Why Palm Beach:<\/strong><\/p>\r\n\r\n<p>Barrett describes his South Florida client loyalty as “fierce,” since he and his customers have continuously flown between states for his services. “People have been begging me for years to come down,” he says.<\/p>\r\n\r\n<p><strong>The salon:<\/strong><\/p>\r\n\r\n<p>Architect Daniel Romualdez designed the Palm Beach salon, which varies exceptionally from the New York location with more modern features and a retail section where customers can browse vintage handbags. It also features an outdoor patio with a garden and a fish pond that clients face during their mani-pedi.<\/p>\r\n\r\n<p><strong>The Barrett philosophy:<\/strong><\/p>\r\n\r\n<p>Barrett's team is versed in styling techniques, but he says his employees' expertise expands beyond beauty knowledge.<\/p>\r\n\r\n<p>“The whole experience has to be extraordinary,” Barrett says. “We live in a city, New York, where people are very vocal about [it] if they're not happy. So, part of our training is about active listening, because we want to really make the clients feel we're on their side.”<\/p>\r\n\r\n<p><strong>The services:<\/strong><\/p>\r\n\r\n<p>Patrons can schedule appointments for haircuts, up-dos, extensions, ponytails, braids, coloring, deep conditioning, straightening treatments, makeup applications, manicures, pedicures, massages, waxing, wraps and more.<\/p>\r\n"}