{"id":"No_more_junk_food_in_schools","templateName":"Interview_Template2","heading":"No more junk food in schools","type":"interview","category":"Health & Fitness","issue":"February 2015","sourceURL":"article\/2015\/02\/No_more_junk_food_in_schools","previousURL":"article\/2015\/02\/Design_NS","nextURL":"article\/2015\/02\/Ocean_Blue_Yacht_Sales","year":"2015","month":"02","subcategory":"HEALTH & fitness","summary":"<p>Kiss sodas, potato chips, candy bars and sugary sports drinks goodbye. The Florida Department of Health in Broward County gives us the update on Florida's new nutrition standards for public and private schools.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/Healthysnacksphoto.jpg"],"description":"<p><strong>Q. When did the nutrition standards go into effect? And what's the gist of the changes?<\/strong><\/p>\r\n\r\n<p>The nutrition standards went into effect on Nov. 1, and removed a lot of the less healthy foods from vending machines, snack bars and stores in the schools. The new rules aim to cut calories, fats and sugars from the snacks available to children, due to increasing rates of childhood obesity. Food items on campus are now healthier.<\/p>\r\n\r\n<p><strong>Q. Tell us about the nutritional standards that vending machines and other venues must comply with.<\/strong><\/p>\r\n\r\n<p>The items must meet at least one of four nutritional standards: At least 50 percent of grains are whole grains; the first ingredient must be fruit, vegetables, dairy or protein; it must contain at least ¼ cup of fruit and vegetables; or contain at least 10 percent of the recommended daily amount of calcium, potassium, vitamin D or fiber.<\/p>\r\n\r\n<p><strong>Q. Is there a calorie limit on the snacks?<\/strong><\/p>\r\n\r\n<p>Snacks must contain no more than 200 calories per serving, no more than 35 percent of calories from fats (no more than 10 percent from saturated fats), and no more than 35 percent of net weight from sugar. Elementary and middle schools can sell only water, low-fat milk or 100 percent fruit or vegetable juice. High schools may also sell lower-calorie sports drinks.<\/p>\r\n\r\n<p><strong>Q. What else should parents and students know?<\/strong><\/p>\r\n\r\n<p>The rules do not apply starting 30 minutes after school ends through midnight. Some say that this allows parents and organizations to sell less healthy foods at after-school games and events to raise money. Also, principals can waive the rules so students and organizations can sell less healthy foods during fundraisers to support their clubs and activities. High schools can allow fundraisers on 15 days per year, middle schools 10 days and elementary schools 5 days. Fundraisers may not start until 30 minutes after the last lunch period.<\/p>\r\n"}