{"id":"OUI_PARIS","templateName":"Interview_Template2","heading":"OUI PARIS!","type":"interview","category":"Nomad's Notebook","issue":"February 2015","sourceURL":"article\/2015\/02\/OUI_PARIS","previousURL":"article\/2015\/02\/Valentines_Day_The_most_romantic_getaways","nextURL":"article\/2015\/02\/Busy_Bee","year":"2015","month":"02","subcategory":"Paris","authorDetails":"<p><em>By<\/em> Gloria Stuart<\/p>\r\n","summary":"<p>A journey to the City of Light never goes out of style.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/OUIPARIS.jpg"],"description":"<p>Magical moments become timeless treasures, especially on a journey to the City of Light. Our trip to Paris was no exception. Dear friends of many years decided their wedding anniversary gift to each other would be a month-long stay in the city of romance. Lucky for us, my husband and I didn't need much encouragement to join them. We at least had to help them discover their next “favorite bistro” around the curving cobblestone corners of Ile Saint Louis. Visually inebriated with inexpressibly elegant avenues, we wandered through the arrondissements, where intoxicating aromas of croissants, flower markets and patisseries permeated our senses. There's nothing like Paris.<\/p>\r\n\r\n<p>Paris' Mandarin Oriental became our homebase for several days and proved to be the perfect location for our self-indulgent meandering, just steps from Place Vendome, the Louvre and Champs-Elysees. Recently opened in the summer of 2012, this gem of a hotel boasts the largest of Paris' hotel spaces and a two-star Michelin restaurant, Sur Mesure by Chef Thierry Marx. In addition to its spectacular two-level spa that incorporates exclusive Guerlain treatments, the Mandarin created a tree-lined courtyard garden – a paradisiacal haven of seclusion bathed in haute-couture settings for breakfast, lunch and late-night aperitifs. It was the perfect place for sipping our chilled Sancerre after a day's exploration – magnificent!<\/p>\r\n\r\n<p>Our meandering through the city summoned up the desire to experience all that Paris inspires within you – your senses set on high alert – especially taste. After our mandatory sampling of those famous macaroons at Laduree – a Parisian staple since 1862 – we were on a roll.<\/p>\r\n\r\n<p>Next was the delectable mid-afternoon bite while touring Montmartre – a crepe with Grand Marnier. It was so delicious, that it became our group's goal to find the tastiest one in Paris – an excuse to eat our way through every café. Besides overwhelming our taste buds, we \u2028concluded that each and every crepe was total perfection. Each one has its own distinctive characteristics. They're truly another example of Le Bon Vie Francaise.<\/p>\r\n\r\n<p><strong>IF YOU GO<\/strong><\/p>\r\n\r\n<p><strong>Don't Miss:<\/strong> While touring on foot, treat yourself to a delightful respite of “tea time” at Le Burgundy Hotel at 6 Rue Duphot. Paris' chic version of “tea” includes smoothies and Champagne cocktails, but with a Parisian twist, of course! Try the Paris Sparkle.<\/p>\r\n\r\n<p><strong>Must do:<\/strong> Incorporate bubbles of happiness into your Parisian journey with a quick rail jaunt to Reims, where famous Champagne houses prevail – the perfect way to discover the origin of these delightful effervescent liquids.<\/p>\r\n\r\n<p><strong>My favorite pick:<\/strong> Pommery, because of its incredible history. In July 1858, Madame Pommery, who was recently widowed, began trailblazing the promotion and branding of luxury products using public relations – imagine that prior to online media. Now it's consumed by royal celebs including Sweden's Princess Victoria at her wedding to Prince Daniel, as well as Brussel's King Leopold II. Is there any other libation that commands such a celebration? Madam's favorite quote: “Never imitate anyone, including yourself.” What a woman.<\/p>\r\n"}