{"id":"Standing_Tall","templateName":"Interview_Profile_Template1","heading":"Standing Tall","type":"interview","category":"Featured Profiles","issue":"February 2015","sourceURL":"article\/2015\/02\/Standing_Tall","previousURL":"article\/2015\/02\/Busy_Bee","nextURL":"article\/2015\/02\/Here_Comes_the_Bride","year":"2015","month":"02","subcategory":"La Tasha McCutchen","authorDetails":"<p><em>by<\/em> Heather Carney<\/p>\r\n","summary":"<p>“Hell's Kitchen” winner, Chef La Tasha McCutchen, opens up about the biggest moment of her career, and her next step as a head chef.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/La-Tasha-Headshot.jpg"],"description":"<p>Imagine keeping the biggest secret of your life for more than a year. Could you do it?<\/p>\r\n\r\n<p>La Tasha McCutchen didn't have a choice. She had to keep quiet ­during media interviews, during drinks with friends, during family holiday gatherings. “[The pressure] was like a year-long tennis match,” she says.<\/p>\r\n\r\n<p>Her secret? The 35-year-old Fort Lauderdale-based chef won the 13th season of Fox's “Hell's Kitchen,” beating 17 other contestants for the position of head chef at the new Gordon Ramsay Pub &amp; Grill at Caesars Atlantic City in New Jersey – a total prize value of $250,000.<\/p>\r\n\r\n<p>“[On Tuesday] I was the lead line cook at 3030 Ocean, and Wednesday night I became Chef Gordon Ramsay's chef,” McCutchen says two days after the finale aired. “For 13 years, I've been the student in the kitchen day in and day out, but I've finally realized that now is my time to become the leader. … It's time to start my reputation as a chef.”<\/p>\r\n\r\n<p>It may be cliche to say, but McCutchen is a small woman with a big personality. She has one of those huge smiles that instantly puts people at ease. Weeks before the finale, at a 3030 Ocean “Hell's Kitchen” watch party, the chef walked from table to table chatting with diners about the show and her southern-style comfort food – think braised short ribs, short rib ragu and mac and cheese. A kid at heart, McCutchen easily makes people laugh, and says that she's been doing so since she was a young girl living in Lake City, South Carolina. Growing up in a family of four girls, she says, groomed her perfectly for the show and her career.<\/p>\r\n\r\n<p>“We all have very different personalities – a lot of strong personalities. In your average kitchen, you're going to have that,” she says.<\/p>\r\n\r\n<p>McCutchen's skill and positive personality consistently garnered her hard-earned praise on the show from Chef Gordon Ramsay, ultimately propelling her to the top spot. “I never tried to undermine anyone else,” she says. “I never tried to make myself more than anyone else. I was a very encouraging teammate.”<\/p>\r\n\r\n<p>McCutchen recalls that after winning the show, Ramsay told her she was “rock solid from day one.” But McCutchen didn't always consider herself to be “rock solid.” She didn't always have confidence in herself, she says.<\/p>\r\n\r\n<p>Maybe that's because for much of her career, she has let others soak up the limelight. She's worked under Chef Paula DaSilva, also a former “Hell's Kitchen” contestant, as well as Chef Adrienne Grenier, a winner of the Food Network's “Chopped.” McCutchen considers both mentors, and credits DaSilva for encouraging her to audition for the Fox show.<\/p>\r\n\r\n<p>Cooking also wasn't the chef's first career choice. McCutchen originally studied computer science before countless episodes of “The Essence of Emeril” helped her realize that her true passion was for food. She wasn't much of a note-taker during class, but McCutchen says she would scribble pages of notes during the cooking show. “I loved to recreate what he did,” she says.<\/p>\r\n\r\n<p>So with that, she changed course. She started out as a server at The Chestnut Grill in Orangeburg, South Carolina, where she learned that “the service of food could really impact someone's day.” Shortly after that, she worked her way to top restaurants like 1500 Degrees at Miami Beach's Eden Roc hotel, and ultimately 3030 Ocean at the Fort Lauderdale Marriott Harbor Beach Resort &amp; Spa. At press time, she was packing up her things to assume her new role as head chef in Atlantic City.<\/p>\r\n\r\n<p>Like any young ambitious professional, McCutchen says she just needed that extra push to propel her onto her next move. “Hell's Kitchen” gave her that nudge in a big way. “I formed a voice, I became a leader,” she says. Her winning menu on the show: prime filet mignon tartare, pan-seared Chilean sea bass and spiced bread pudding.<\/p>\r\n\r\n<p>When asked if she would do it all over again, even if it meant keeping the biggest secret of her life for another year?<\/p>\r\n\r\n<p>“Hell yeah,” she says. “Of course.”<\/p>\r\n"}