{"id":"SUGAR_RUSH_","templateName":"Simple_Collection_Feature_Template2","heading":"SUGAR RUSH: ","type":"simple_collections","category":"Features","issue":"February 2015","sourceURL":"article\/2015\/02\/SUGAR_RUSH_","previousURL":"article\/2015\/02\/Here_Comes_the_Bride","nextURL":"article\/2015\/02\/Night_Out_at_the_Museum_with_our_2015_Best_Catches","year":"2015","month":"02","subheading":"The Best Desserts in South Florida","authorDetails":"<p><em>By<\/em> Heather Carney, Briana Dodson, Jennifer Tormo and Aly Zofcin<em>Photography by<\/em> Jason Nuttle<\/p>\r\n","summary":"<p>Our editorial team will take pretty much any opportunity to indulge in dessert. So writing an article about the best ones from Delray to Fort Lauderdale seemed like an idea too good to pass up. We compared and contrasted cookies, candies and cakes, debated over doughnuts for days and sampled more cupcakes than we could keep track of – all to bring you this list of the 25 best desserts in our area.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/collection_main_image\/SUGAR.jpg"],"itemscollection":[{"headline":"Best Red Velvet Dessert: Café Martorano","description":"<p>Eat early and stay for the disco music and dessert at this Italian restaurant and night club. The red velvet cake is to die for, with three layers of rich, moist cake frosted with light and fluffy vanilla cream cheese frosting.<\/p>\r\n\r\n<p>3343 E. Oakland Park Blvd., Fort Lauderdale | 954.561.2554 | cafemartorano.com<\/p>\r\n","imageorvideo":[]},{"headline":"BEST MILKSHAKES THE FOXY BROWN","description":"<p>We'll let you in on a little secret: Our office is right across the street from The Foxy Brown. So when we need a late afternoon pick-me-up, the Foxy Brown milkshake is a go-to. The shakes are hand-spun in house with vanilla bean ice cream, milk, vanilla bean sauce, and then chocolate or strawberry syrup. It's pretty much unanimous in our office: These are the best milkshakes any of us have ever had.<\/p>\r\n\r\n<p>723 E. Broward Blvd., Fort Lauderdale | 754.200.4236 | myfoxybrown.com<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/Foxy-Brown.jpg"}]},{"headline":"Best DOUGHNUTS: Max’s Harvest","description":"<p>As the doughnut trend explodes across South Florida, the competition in this category was high. But, we had to go with this hidden gem. The bite-size brioche doughnuts served during brunch at this farm-to-fork restaurant are warm, fluffy and buttery. The icing on the cake? The “every berry” preserve and the “vanilla creme” anglaise served on the side for dipping. Crazy good.<\/p>\r\n\r\n<p>169 NE Second Ave., Delray Beach | 561.381.9970 | maxsharvest.com<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/Maxs-Harvest.jpg"}]},{"headline":"Best Homemade Ice Cream: Rag Doll Ice Cream","description":"<p>Pastry Chef Donna Silverthorn, known for her creations at Beauty &amp; the Feast, made a lifelong dream come true last year when she started her own ice cream business. Silverthorn's hope is to become the next Ben &amp; Jerry's, but with better ingredients and all homemade recipes. Her flavors are insane – the Key lime pie is a must-try, as are rotating flavors like blueberry crumble, chocolate Oreo fudge and sweet potato pie with pecan swirl. For now, you can catch her at the Yellow Green Farmers Market in Hollywood on weekends, but we'd guess it won't be long before she has a parlor of her own.<\/p>\r\n\r\n<p>1940 N. 30th Road, Hollywood | 954.240.7932 | facebook.com\/ragdollicecreamparlor<\/p>\r\n","imageorvideo":[]},{"headline":"Best Creme Brulee: Kapow! Noodle Bar at Mizner Park","description":"<p>You may have ventured to Kapow! Noodle Bar for its savory noodles or Sunday brunch with endless mimosas, but next time you go, make sure you say, “Yes!” to dessert. The chai-lavender crème brûlée is unlike any other crème brûlée you've tasted. It is as light as a cloud and has an ever-so-faint floral flavor blended with the calming hint of chai tea with a smooth texture. The sugary crust on top enhances the flavors hiding just below it.<\/p>\r\n\r\n<p>Mizner Park, 431 Plaza Real, Boca Raton | 561.347.7322 | kapownoodlebar.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Cupcake: Sweeter Days Bake Shop","description":"<p>Dubbed “best cupcake” by our team in our 2012 “Best Of South Florida,” it's easy to see why we are featuring it one more time. The red velvet and salted caramel cupcakes are closely tied as the shop's best sellers. The salted caramel is topped with a caramel drizzle, red Hawaiian sea salt and a praline crunch atop a macadamia and almond buttercream. Bite into the white cupcake and a river of caramel flows from the center. It's downright delectably sinful – and we're not the only ones who have noticed. The cupcake won “best cupcake” at the South Florida Food and Wine festival last year.<\/p>\r\n\r\n<p>Plaza Del Mar Shopping Center, 1497 N. Federal Highway, Fort Lauderdale | 954.396.3979 | sweeterdaysbakeshop.com<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/Sweeter-Days-Bake-Shop.jpg"}]},{"headline":"Best Carrot Cake: Beauty & the Feast","description":"<p>As if the swanky, chic atmosphere of The Atlantic Hotel &amp; Spa's restaurant wasn't enough, the carrot cake is out of this world – perfectly spiced, layered with cream cheese icing and paired with homemade coconut gelato. The cake is the work of Pastry Chef Donna Silverthorn, who makes all of the desserts and pastries in house.<\/p>\r\n\r\n<p>Atlantic Hotel &amp; Spa, 601 N. Fort Lauderdale Beach Blvd., Fort Lauderdale | 954.567.8070 | atlantichotelfl.com\/dine-atlantic\/beauty-the-feast-bar-kitchen<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/Beauty-the-Feast.jpg"}]},{"headline":"Best Bread Pudding: Canyon Restaurant","description":"<p>A haven for Southwestern infusion, Canyon is known for its Prickly Pear margaritas. Another must-have? Its Mixed Berry White Chocolate Bread Pudding. A mixture of dark and white chocolates baked together, topped with a mixed berry compote, it's the perfect bite of sweetness.<\/p>\r\n\r\n<p>1818 E. Sunrise Blvd., Fort Lauderdale | 954.765.1950 | canyonfl.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Cake: We Take the Cake","description":"<p>The quaint, mail-order bakery, We Take the Cake in Fort Lauderdale, specializes in handmade, custom-designed cakes that are sure to make each taster fall in love at first bite. Named “Favorite Thing,” the Key Lime Cake is a must-try. Handcrafted from some of the finest ingredients, each moist, decadent cake is spritzed with tangy Key lime juice and topped with a Key lime cream cheese, which is sure to leave Key lime lovers in complete bliss down to the last bite. Each cake can be ordered online and delivered straight to your doorstep. And apparently, it's one of Oprah's favorites.<\/p>\r\n\r\n<p>1211 NE Ninth Ave., Fort Lauderdale | 954.764.2253 | wetakethecake.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Macaroon: Le Macaron","description":"<p>Those longing to travel to France can find an escape at Mizner Park in Le Macaron, where more than 20 flavors of the popular French cookie are perfected. One of the best sellers, the Belgian Chocolate macaroon features a light, crispy outside filled with a rich Belgian chocolate ganache and chocolate cream, promising to fill taste buds with chocolately goodness. Other flavors include Lavender White Chocolate, featuring a white chocolate ganache and a crispy, lavender-colored outer shell; and Raspberry with a raspberry-flavored jam center and a crisp, light pink shell. With mini-pastries this delicious, it is no surprise that they are known as the “jewels of France.”<\/p>\r\n\r\n<p>331 Plaza Real, Boca Raton | 561.245.7281 | lemacaron-us.com\/boca-raton<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/lemacaron.jpg"}]},{"headline":"Best Ice Cream Sandwich: Steak954","description":"<p>Is it just us, or are ice cream sandwiches becoming a thing? Steak954 offers one of the most unique takes on the dessert with its trio of ice cream sandwiches. Each sandwich is just the right size to split in half and share (or, you know, eat all by yourself). The types of sandwiches change based on the pastry chef's selection, but the last time we visited, the restaurant was serving a red velvet sandwich; banana with caramel sandwich; and coffee ice cream and brownie sandwich. You really can't go wrong with anything on Steak 954's dessert menu – it lives up to its reputation as one of the best restaurants in Fort Lauderdale – but this dessert just takes the cake.<\/p>\r\n\r\n<p>W Hotel Fort Lauderdale, 401 N. Fort Lauderdale Beach Blvd., Fort Lauderdale | 954.414.8333 | steak954.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Sundae: Jaxson’s Ice Cream Parlour and Restaurant","description":"<p>It's easy to find an ice cream parlor nowadays that serves a colossal sundae in some kind of funky, sink-like bowl. But, have you had the original? Jaxson's Ice Cream Parlour's Famous Original Kitchen Sink sundae is enough to feed a small army. Grab at least three of your closest ice-cream-lovin' friends and attempt to shovel through approximately 40 scoops of ice cream loaded with all of your favorite toppings.<\/p>\r\n\r\n<p>128 S. Federal Highway, Dania Beach | 954.923.4445 | jaxsonsicecream.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Gelato: HipPOPS Gelato Bars","description":"<p>Not your average food truck, HipPOPS specializes in gelato ice pops. Yes, you read that right: gelato on a stick. It gets even better, too. Once you choose a gelato pop flavor, they'll dip it in any kind of chocolate you want: milk, semi-sweet or white. Then, pick one of their many “poppings” and they'll roll the hand-dipped gelato popsicle in whatever topping you choose. We recommend the Belgian chocolate gelato pop, dipped in white chocolate and “popped” with rainbow sprinkles.<\/p>\r\n\r\n<p>954.674.2211 | see website for truck locations: hippops.com\/find-us<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/HipPOPs.jpg"}]},{"headline":"Best Key Lime Pie: Madisons New York Grill & BAR","description":"<p>The average diner probably plans a meal at Madisons for the steaks, but don't overlook the dessert menu. The best surprise at the end of the meal is the restaurant's creamy, sweet and sour Key lime pie. It comes with a buttery crust, a filling that's cream in color – not a fake lime green – and a nice dollop of homemade whipped cream. It's also a generous portion – just the right size for two people to share.<\/p>\r\n\r\n<p>2006 NW Executive Center Circle, Boca Raton | 561.994.0808 | madisonsnewyork.com\/restaurants<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/Madisons.jpg"}]},{"headline":"Best Cookie: Two Fat Cookies Bakery","description":"<p>“Head Cookie” Debbie Wexler serves up some of the best handmade cookies in South Florida. Joined by her daughter, Zoey, the duo handcrafts original recipes, like the Chip Monsters, one of the most popular cookies, which is loaded with rich, semi-sweet chocolate morsels and baked to golden perfection. Other favorites include the popular Globs and Fatsos.<\/p>\r\n\r\n<p>245 NE Second Ave., Delray Beach | 561.265.5350 | twofatcookies.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Hot Chocolate: Serendipity at the Boca Raton Resort","description":"<p>Step back in time 20 years when you enter this old-fashioned (yet, modernly decorated) ice cream parlor tucked neatly inside the Boca Raton Resort &amp; Club. The ceiling is adorned with ornate chandeliers, and the colorfully classic décor carries throughout the restaurant. Be sure to order the frozen hot chocolate. Alongside the old-fashioned sundaes and splits, this unique dessert is topped with fluffy whipped cream and chocolate shavings. We recommend finding someone to share the hot chocolate with – it's huge.<\/p>\r\n\r\n<p>Boca Raton Resort and Club, 501 E. Camino Real, Boca Raton | 561.447.3000 | bocaresort.com\/dine\/serendipity.html<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/SerendipityHotChocolate.jpg"}]},{"headline":"Best Cannoli: Dominic’s I in Boca","description":"<p>Driving by this non-descript, family-owned Italian restaurant located inside a Boca strip mall, one would never guess that the most authentic Italian food is served inside. The friendly owner knows all of his regulars by name. At the end of your meal, be sure to say, “Yes!” when the waiter offers dessert and cappuccinos. Filled to order, the cannolis are like a little taste of Italy in every bite. The cassata cream filling is richly indulgent and the cannoli shell makes the most beautiful crunching sound when you bite into it. Take a sip of your cappuccino, and just imagine yourself sitting at a café in Rome.<\/p>\r\n\r\n<p>West Boca Plaza, 8177 W. Glades Road #19, Boca Raton | 561.487.3186 | dominicspizzapasta.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Breakfast Dessert: Pinon Grill","description":"<p>Feed sweet and savory cravings at Pinon Grill in Boca Raton. Whether you're there for the $15 bottomless mimosas during weekend brunch or enjoying a quiet dinner with family, end it with breakfast for dessert with the Flourless Chocolate Waffle. The treat features two dark, Belgian chocolate flourless waffles, crowned with ice cream and a raspberry drizzle, and sprinkled with powdered sugar. Breakfast for dessert will never be the same.<\/p>\r\n\r\n<p>Town Center at Boca Raton, 6000 Glades Road #1390, Boca Raton | 561.391.7770 | pinongrill.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Rum Cake: Olde Estate","description":"<p>Handed down throughout generations, the recipes from the Olde Estate in Boca Raton create some of the most delicious rum cakes. A customer favorite, the Vanilla Raisin Walnut Rum Cake is baked to a golden brown, loaded with scrumptious plump raisins, rich walnuts and drizzled with shredded, rich coconut. Another favorite is the Banana Rum Cake, perfect for eating at breakfast, lunch or dinner, filled with a delicious, warm banana center. For the chocolate lover, try the Chocolate Chip Rum Cake, teeming with sweet chocolate chip morsels, paired with a scoop of ice cream and a topping of your choice.<\/p>\r\n\r\n<p>561.400.7444 | oldeestate.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Pie: The Good Pie Company","description":"<p>Next time you're in the mood for an old-fashioned apple pie, call up the Good Pie Company in Davie. The owner uses her great-grandmother's recipe for this delectable vintage dessert. The best part – it's completely customizable. Choose between a lattice or crumb top, and even add another complementary fruit to your pie, such as strawberry, cherry or even cranberry. With more than 40 pies to choose from, including a pumpkin chocolate ganache, the possibilities are endless.<\/p>\r\n\r\n<p>5665 S. University Drive, Davie | 954.562.4760 | thegoodpiecompany.net<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/The-Good-Pie-company.jpg"}]},{"headline":"Best Pastries and Cookies: Doris Italian Market","description":"<p>The best place to find all of your Italian meats and deli items is also the best place to purchase Italian pastries and cookies by the pound. Have you ever tried a pasticiotti? The cake-y pastry filled with a rich, sweet vanilla cream and sprinkled with powdered sugar is one of our favorites. Need a cookie platter for your dinner party? There's an array of freshly baked Italian cookies for your choosing.<\/p>\r\n\r\n<p>9101 Lakeridge Blvd., Boca Raton | 561.482.0770 | dorismarket.com<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/Doris-Italian-Market-2.jpg"}]},{"headline":"Best S’more: Himmarshee Public House","description":"<p>This cookie S'more takes it up a notch by combining everything we love about the two treats into one, non-messy dessert snack. The graham cracker cookie holds the gooey marshmallow and chocolate chunks together making it easy to eat. The creation comes paired with a small glass of Public House's very own vanilla milk complete with a straw. It's what every childhood campfire S'more was missing.<\/p>\r\n\r\n<p>201 SW Second St., Fort Lauderdale | 954.616.5275 | publichouseftl.com<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/Public-House.jpg"}]},{"headline":"Best Tiramisu: D’Angelo Trattoria","description":"<p>After experiencing a fire and rebuilding under a new name, this restaurant is a force to be reckoned with in downtown Delray. The restaurant is here to stay, especially with memorable desserts like the tiramisu. This feathery homemade, family recipe is so good you'll be sad to take the last bite. The sprinkled cocoa on top gives the light and airy, sweet mascarpone cream the perfect chocolate kick. It's complemented by espresso-soaked ladyfingers between every layer of the cream.<\/p>\r\n\r\n<p>9 SE Seventh Ave., Delray Beach | 561.330.1237 | dangelotrattoria.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Candy: To the Moon Marketplace","description":"<p>You'll feel like a kid in a candy store at To The Moon Marketplace. The store offers more than 13,000 types of hard-to-find and bulk candy from black licorice to gourmet snacks and spreads from more than 60 countries. One of the most unique is the Tim Tam, a chocolate, two-layer malt biscuit coated with a thin layer of textured chocolate and filled with a delicious, light chocolate filling. Other favorites include carrot cake flavored M&amp;Ms, bacon-flavored soda, moon pies and more.<\/p>\r\n\r\n<p>2205 Wilton Drive, Fort Lauderdale | 954.564.2987 | tothemoonmarketplace.com<\/p>\r\n","imageorvideo":[]},{"headline":"Best Shaved Ice or Snow Cone: Florida Snow Factory","description":"<p>The Florida Snow Factory is a wonderland of all things frozen. The factory's frozen yogurt is definitely one to write home about. Most shaved ice crunches so loudly that you can't hear yourself think, but this pillowy shaved ice melts easily on your tongue. Try the blue-raspberry flavor, which will instantly remind you of spending a day at the fair eating cotton candy.<\/p>\r\n\r\n<p>Harbor Shops, 1909 Cordova Road, Fort Lauderdale | 954.284.6782 | floridasnowfactory.com<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/02\/The-Florida-Snow-Factory-2.jpg"}]}]}