{"id":"The_trouble_with_romance","templateName":"Publisher_Letter","heading":"The trouble with romance...","type":"interview","category":"Publisher's Letter","issue":"February 2015","sourceURL":"article\/2015\/02\/The_trouble_with_romance","previousURL":"article\/2015\/02\/Apura_Grand_Opening","nextURL":"article\/2015\/02\/Your_floors_Our_passion","year":"2015","month":"02","subcategory":"Bernard mcCormick","subheading":"Hers was one of the more memorable examples of romance complicating our editorial lives. compcomplicating our editorial lives.","summary":"<p>It isn't the first time. Back in the last century we had a managing editor who, upon leaving us, revealed that one reason she took this job was to meet a rich man. She did, and faster than you could say “I met a rich man,” she was out of here. Hers was one of the more memorable examples of romance complicating our editorial lives. We lost an excellent production person last year after romance led to marriage, which in turn led to stay-at-home motherhood.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/02\/PubletterJan.jpg"],"description":"<p>We have seen the flip side of such happy events. On at least two occasions, we've had young women who've followed guys to Florida, and when they broke up, the employees were out of here faster than you can say, “I'm out of here.” They went back to the snow regions from whence they came.<\/p>\r\n\r\n<p>This is by way of bidding an affectionate farewell to our managing editor, Jennifer Tormo, who was with us for almost five years, the last year as managing editor, before leaving for the usual reason. He lives in New Orleans, and her new job is editor of a lifestyle magazine in nearby Baton Rouge. She left on the best possible terms. Although her last day was in late November, she made sure we had time to find a replacement by doing exceptional work that appears throughout this issue. You will see her byline on several stories in this and our related magazines on the Treasure Coast. And she had already found the person to fill her shoes.<\/p>\r\n\r\n<p>Last year she had a strong voice in hiring Heather Carney, who has been with us just long enough to master the ropes of the job one rung above. During what is our busiest time of the year, with all the distractions of the holidays, Carney stepped up and made what might have been a crisis into a seamless transition. Her new title as managing editor is in this month's masthead. And her slot as assistant editor now goes to Alyssa Morlacci. For a recent college grad (Kent State in Ohio) she brings unusual experience to the job. She was editor of her college magazine, and she interned for a summer with Cleveland Magazine, a long-established publication that does many of the same kinds of stories that we regularly feature.<\/p>\r\n\r\n<p>One such category is an elegant wedding feature, which appears in this issue on page 58. It is one of the bon voyage stories written by Tormo. She also contributed to a companion story, “Best Catches,” on page 80. That idea has undergone some sociological tweaking over the years. We first did that kind of story back in the 1970s.<\/p>\r\n\r\n<p>Tormo was also part of a savory team that researched the desserts feature on page 64. Jason Nuttle's photos make the salivary glands do their job. Isn't it all very romantic, in more ways than one?<\/p>\r\n\r\n<p><img class=\"nowrap\" src=\"\/projectflip-frontend\/projectflipadmin\/sites\/default\/files\/articles\/description\/images\/signature.jpg\" \/><\/p>\r\n"}