{"id":"Valentines_Day_The_most_romantic_getaways","templateName":"Check_List_Template1","heading":"Valentine’s Day: The most romantic getaways","type":"check_list_travel_talk","category":"Travel Talk","issue":"February 2015","sourceURL":"article\/2015\/02\/Valentines_Day_The_most_romantic_getaways","previousURL":"article\/2015\/02\/Apeiro_Kitchen_Bar","nextURL":"article\/2015\/02\/OUI_PARIS","year":"2015","month":"02","subcategory":"Valentine’s Day","subheading":"Reignite the romance with these getaways perfect for stealing a kiss from your sweetheart.","authorDetails":"<p>Contact <strong>Gloria Stuart<\/strong> at <a href=\"gloria@gulfstreammediagroup.com\" target=\"_blank\">gloria@gulfstreammediagroup.com<\/a><\/p>\r\n","checklistcollection":[{"headline":"Twelve Apostles","description":"<p>Celebrate the most romantic day of the year like celebs. Known as Capetown, South Africa's most romantic hotel, the Twelve Apostles is not only a fabulous place to steal a kiss, but it is widely known as one of the best spots for a wedding proposal. “The Royal Proposal” package begins with a B Together spa treatment for two that includes use of the spa plunge pools and salt water floatation pool, followed by sunset cocktails and canapés served on the private terrace of the Presidential Suite<\/p>\r\n","contactNumbers":[],"websiteUrls":["http:\/\/12apostleshotel.com"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/02\/12AMountainWalks.jpg"}]},{"headline":"Naples Grande Beach Resort","description":"<p>Inspired by the hit novel, Fifty Shades of Grey, the new Naples Grande Beach Resort is offering the “Laters, Baby” package, including a bottle of sparkling wine, chocolate covered strawberries upon arrival and a daily breakfast buffet for two, along with a $100 spa treatment credit. The resort has enjoyed an $18 million renovation redesign of all 474 guestrooms and suites, restaurants, the beach area and common spaces<\/p>\r\n","contactNumbers":["844.993.9576."],"websiteUrls":["http:\/\/naplesgrande.com"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/02\/AerialExterior.jpg"}]},{"headline":"Casa Marina Resort","description":"<p>Nestled along the largest private beach on the island, the Casa Marina Resort in Key West invites couples to toast to their love this Valentine's Day in “A Room with a Veuve.” Upon entering intimate beachfront accommodations, couples can indulge on delicious items like Veuve Clicquot Brut ‘Yellow Label,' chocolate covered strawberries and more. After oceanfront spa treatments and dining by candlelight with toes in the sand, couples retreat back to their rooms for a romantic evening on a private balcony overlooking the Atlantic Ocean<\/p>\r\n","contactNumbers":["305.296.3535."],"websiteUrls":["http:\/\/casamarinaresort.com"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/02\/CasaMarinaAWaldorfAstoriaResort.jpg"}]},{"headline":"PalazzinaG","description":"<p>Stroll along Venice's Grand Canal while enjoying a romantic retreat at PalazzinaG. This 16th Century structure once served as a Roman bath, but has been redesigned by Philippe Starck. Each room evokes a decadent atmosphere while maintaining the elegance of Venetian grandeur. During the “Unconventional Picnic Experience,” guests are whisked away by a private taxi to the island of St. Erasmo where they can relax while feasting on plates fixed by Chef Luigi. Upon return, guests toast to romance at the prestigious Maison Champagne Krug Lounge<\/p>\r\n","contactNumbers":["1.800.337.4685."],"websiteUrls":["http:\/\/designhotels.com"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/02\/027dspalazzinag.jpg"}]},{"headline":"Mandarin Oriental","description":"<p>The name of the special “Kisses From Paris” says it all. Located on the fashionable rue Saint-Honoré street in Paris, the Mandarin Oriental is the toute suite pied-à-terre for travelers. For Valentine's Day, the hotel is offering a one-night stay with breakfast in-room, or at the Camelia restaurant, and includes a romantic welcome amenity – “French Kiss” perfume engraved with the name of your sweetheart and a “Kiss Kiss” lipstick by Guerlain<\/p>\r\n","contactNumbers":["1.800.526.6566."],"websiteUrls":["http:\/\/mandarinoriental.com"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/02\/parissuiteroyaleorientaleterrace2.jpg"}]}]}