{"id":"2015s_Four_Killer_Trends_in_Outdoor_Living","templateName":"Trend_Watch_Template1","heading":"2015's Four Killer Trends in Outdoor Living","type":"simple_collections","category":"Trend Watch","issue":"March 2015","sourceURL":"article\/2015\/03\/2015s_Four_Killer_Trends_in_Outdoor_Living","previousURL":"article\/2015\/03\/Anchors","nextURL":"article\/2015\/03\/The_Perfect_Match_Polo_and_Brunch","year":"2015","month":"03","authorDetails":"<p><strong>What's popular noW: <\/strong><\/p>\r\n\r\n<p>For more trends, visit the International Casual Furnishings Association's website, ICFAnet.org. The non-profit trade association has more than 350 member manufacturers, retailers, designers, sales representatives and suppliers specializing in outdoor furnishings.<\/p>\r\n","summary":"<p>Outdoor furnishings introduced for 2015 are colorful mash-ups of global design and lifestyle trends. From seating and dining designed for lingering to fabrics and accessories in every happy shade imaginable, furnishings for outdoor living have taken a vibrant, sophisticated turn. Here are four top trends from the International Casual Furniture &amp; Accessories Market, the premier American showcase for new outdoor designs.<\/p>\r\n","itemscollection":[{"headline":"A ShAde of drama","description":"<p>Innovations in fabric design and performance have brought a host of new looks to the umbrella category in recent years. Bold combinations of color and pattern can make the canopy overhead a dramatic focal point of your outdoor setting. Treasure Garden's unique Shanghai Collar tilt umbrella in iris canvas is one of thousands of options the company offers.<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Treasure-Garden.jpg"}]},{"headline":"dine Around","description":"<p>The popularity of alfresco dining has been on the rise, and so has the number of options in outdoor table configurations. While long, rectangular tops with benches were popular in 2014, this year curves abound in outdoor dining. Woodard's 98-inch Oval Casa Table with stackable armchairs comfortably seats up to 10.<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Woodard-Casa-Dining.jpg"}]},{"headline":"fire feAtureS","description":"<p>Fire places, fire pits, fire tables and torches are all the rage - and one of the top three most desired additions to outdoor living spaces for 2015, according to research by the International Casual Furnishings Association. From sleek, contemporary silhouettes, like Telescope's fire table made with Marine Grade Polymer, to rugged, wood-burning pits, fire features are the hottest trend this year.<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Telescope.jpg"}]},{"headline":"ConverSAtion StArterS","description":"<p>Enough with the digital communication already! Enjoying face-to-face time has never been easier with new furniture designs to facilitate conversation. Brown Jordan's Luna Sunport gets the dialogue started when it's one-on-one, but for larger gatherings, look for the latest offerings in sectional-style seating, crescent-shaped sofas and loveseats to use in pairs, or deep, club-style chairs for when the conversation - or just the company - is worth lingering.<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Brown-Jordan.jpg"}]}]}