{"id":"5_Spring_Breakaways","templateName":"Check_List_Template1","heading":"5 Spring Breakaways","type":"check_list_travel_talk","category":"Travel Talk","issue":"March 2015","sourceURL":"article\/2015\/03\/5_Spring_Breakaways","previousURL":"article\/2015\/03\/Sapphire_Indian_Cuisine","nextURL":"article\/2015\/03\/Holding_Court","year":"2015","month":"03","subcategory":"Valentine's Day","subheading":"From a historic resort to a back-country fishing trip, these five vacation packages  offer guests the ultimate spring getaway.","authorDetails":"<p>Contact <strong>Gloria Stuart<\/strong> at <a href=\"gloria@gulfstreammediagroup.com\" target=\"_blank\">gloria@gulfstreammediagroup.com<\/a><\/p>\r\n","checklistcollection":[{"headline":"Inn on the Alameda","description":"<p>Santa Fe, New Mexico: The Inn on the Alameda, in partnership with the Museum of Indian Arts and Culture, invites you to experience \"Turquoise, Water, Sky: The Stone and Its Meaning.\" This three-night offer is available through April 30, and includes museum passes for the history of turquoise in the Southwest. The stay includes lavish buffet breakfasts – think stuffed croissants – plus nightly wine and cheese receptions;<\/p>\r\n","contactNumbers":["888.984.2121"],"websiteUrls":["http:\/\/innonthealameda.com"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/03\/Inn-on-the-Alameda54.jpg"}]},{"headline":"The Caves","description":"<p>Negril, Jamaica: An exclusive hideaway located atop spectacular, cave-riddled limestone cliffs. The property is comprised of 12 thatched cottages overlooking the Caribbean Sea on 10-acres of secluded land. The Caves' \"Inna Mi Heart\" offer allows guests to relax and rejuvenate with complimentary experiences such as dining in a cave, a Continental Blue Mountain Scrub treatment and a shuttle ride to Negril Beach. The offer is available from April 1 to December 1;<\/p>\r\n","contactNumbers":["800.688.7678"],"websiteUrls":["http:\/\/islandoutpost.com\/hotels-and-villas\/the-caves\/"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/03\/Caves-Cottage.jpg"}]},{"headline":"South Seas Island Resort","description":"<p>Captiva Island, Florida: Seemingly set adrift off the Gulf Coast, this unspoiled haven encompasses 330 acres of wildlife preserve and two-and-half miles of shell-strewn beaches. The \"Winter Getaway Package\" is available through April, when guests stay for three nights or longer. Receive $25 per day in resort credits applied toward resort activities and restaurants. Guests also receive a coupon book valuing more than $250 in savings for family activities;<\/p>\r\n","contactNumbers":["239.472.5111"],"websiteUrls":["http:\/\/southseas.com\/special-offers-en.html"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/03\/dock.jpg"}]},{"headline":"The Vinoy Renaissance Resort & Golf Club","description":"<p>St. Petersburg, Florida: With its grand opening on New Year's Eve in 1925, the Vinoy's 90th anniversary is around the corner. Today, the resort is restored to its original grandeur of intricately carved stone columns and elaborate frescos. The resort began with a bet at a party in 1923, when PGA champion Walter Hagen drove golf balls off the face of his host's prized pocket watch. The Vinoy embraces its history by asking guests to participate in the \"R Moment\" – a chance to hit a golf ball off of a pocket watch with an original Walter Hagen club;<\/p>\r\n","contactNumbers":[],"websiteUrls":["http:\/\/marriott.com"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/03\/Night-time.jpg"}]},{"headline":"Little Palm Island Resort & Spa","description":"<p>Lower Florida Keys: This five-and-a-half-acre private island is accessible only by boat or seaplane, and is a favorite of U.S. presidents and celebrities. These 15 spacious thatched-roof bungalows offer ocean views and fabulous interiors. The resort's Noble Adventure Package includes a five-night stay for two, a half-day back-country fishing trip, a seaplane flight to Key West, a $300 spa credit and more;<\/p>\r\n","contactNumbers":["305.872.2524"],"websiteUrls":["http:\/\/littlepalmisland.com"],"priceDetails":"","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/checklist_collection_images\/2015\/03\/Firepit.jpg"}]}]}