{"id":"A_Craft_Connoisseur","templateName":"Interview_Profile_Template1","heading":"A Craft Connoisseur","type":"interview","category":"Featured Profiles","issue":"March 2015","sourceURL":"article\/2015\/03\/A_Craft_Connoisseur","previousURL":"article\/2015\/03\/Holding_Court","nextURL":"article\/2015\/03\/Captain_Planet","year":"2015","month":"03","subcategory":"Portrait \/\/ Lauren Bowen","subheading":"South Florida is making carbonated, locally brewed waves in its  bar scene. And at the head of the current is an atypical craft beer  distributing rep: Lauren Bowen.","authorDetails":"<p><em>BY <\/em> Alyssa Morlacci<em>Photography by <\/em> Jason Nuttle<\/p>\r\n","summary":"<p>Lauren Bowen sits beneath falling vines that decorate the patio awning at Sweet Nectar on Las Olas Boulevard her blonde, pixie buzz cut and chunky black glasses remnants of her short fashion career. Her hands cup a honey jar filled with a golden liquid, but it wasn't produced by bees. It was actually made by the company Bowen represents Harpoon Brewery. And, it's her favorite craft beer UFO White.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/03\/Lauren-Bowen.jpg"],"description":"<p>The 24-year-old brewery sales rep's pearly skin makes her appear as if she's a non-native South Floridian, but her ability to not perspire on a hot Monday morning gives her away. Her arms, revealed by a black tank top paired with a gray infinity scarf, don cartoons and words in ink that she's collected over the years three of which honor craft beer.\"I stick out like a sore thumb because I'm probably one of the only people with tattoos who works for Harpoon,\" Bowen says.<\/p>\r\n\r\n<p>But, her tattoos aren't the only factors that make her stand out from her colleagues. From putting popular Fort Lauderdale restaurant Tap 42 on the craft beer map to helping breweries grow their presence in South Florida, Bowen has become an instrumental player in strengthening the area's craft beer scene. \"At the end of the day, it's all about bringing good beer to people, and sharing it. That's it,\" Bowen says of her passion for the craft.<\/p>\r\n\r\n<p>Bowen remembers her first beer a brown ale with a nutty, malty and caramel taste. She'd always been allergic to nuts, but she was able to experience the taste through different beers. While she was attending the Art Institute in Fort Lauderdale for fashion merchandising, Bowen would hide her craft beer books inside her assigned microeconomics readings during class. She also filled about five tablets logging each new beer she tried.<\/p>\r\n\r\n<p>Bowen interviewed for a server position with Tap 42 when she was 21 years old. She was offered the position on the spot, and started work that same day. After a month, she was asked to take over the beer ordering duties. In addition to improving the beer selection making sure there were always six Harpoon options on tap she also implemented a training program for staff members to educate them on different brews.<\/p>\r\n\r\n<p>After spending about two years with the company, Bowen knew she wanted her next step to be working for a brewery. Through connections she made at Tap 42, Bowen found out that Harpoon's CEO, Rich Doyle, would be in town for one night. So, she sent a \"fan-girl\" email asking him to breakfast, and he accepted.<\/p>\r\n\r\n<p>\"Fifteen minutes into breakfast he asked, ‘Do you ever see yourself working for Harpoon?' And I was like, ‘Of course, it's where I want to live and die at,'\" Bowen says. She was offered a job on the spot; again.<\/p>\r\n\r\n<p>Now Bowen is one of, as she guesses, five female brewery reps in her national company. In a male-dominant trade, Bowen says she's often mistaken for a promotions girl. \"I'm like, ‘No, I'm not like, the shots girl.' That's probably the most offensive thing that happens on a daily basis,\" Bowen says.<\/p>\r\n\r\n<p>But she doesn't let those remarks put her down. Just four years into her professional career, Bowen says she is working for her dream employer. And, she says, the industry is quickly evolving and growing in South Florida. \"Being a part of Harpoon is amazing,\" Bowen says. \"I'm not going anywhere.\"<\/p>\r\n"}