{"id":"A_Detox_Challenge","templateName":"Interview_Template2","heading":"A Detox Challenge","type":"interview","category":"Health & Fitness","issue":"March 2015","sourceURL":"article\/2015\/03\/A_Detox_Challenge","previousURL":"article\/2015\/03\/The_Guide_To","nextURL":"article\/2015\/03\/Ocean_Blue_Yacht_Sales","year":"2015","month":"03","subcategory":"BALANCE \/\/ HEALTH & FITNESS","subheading":"Managing Editor Heather Carney embarks on a five-day organic, plant-based detox to reset after the indulgent holidays.","authorDetails":"<p><em>By <\/em> Heather Carney<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/03\/One_day_in_open_boxes.jpg"],"description":"<p><strong>What it is: <\/strong> The Oakland Park-based com- pany, DL Revamp, offered me its five-day “reset” cleanse. It comes with juices, salads, snacks and more, plus an Amp It Up Kit to prep for the cleanse. The company offers three- to 10-day plans meant for every- one from beginners to avid cleansers. The detox isn't “juicing.” (Thank goodness for chewing.) Instead, the cleanse offers organic, plant-based foods, and bridges the gap be- tween traditional foods and liquid cleanses. I said, “Sign me up.”<\/p>\r\n\r\n<p><strong>How it works: <\/strong> Since the cleanse isn't just five juices per day, the food and drinks come in large freezer-packed bags. All DL Revamp cleanses are scheduled to start on a Tuesday. I received two different shipments for the five-day cleanse the week of my detox – the first on Tuesday, the second on Thursday. Here's a sampling of my meals for the days: cran-lemon chia water, kale berry coconut smoothie, cold-pressed juice by OnJuice, a detox power salad, a power shot, raw cacao truffles, garden soup and a detox tea. Sounds like a decent amount of food, right? In the first shipment, I also received my Amp It Up Kit complete with a lavender soy candle, bath salts, a dry skin brush for lymphatic stimulation and a cooler bag, plus a T-shirt.<\/p>\r\n\r\n<p><strong>My experience: <\/strong> Let me say, the cleanse was definitely a challenge. But there were certain aspects that I really enjoyed about it. The starter kit made the cleanse feel like a whole-body experience, rather than just a quick-fix diet. Plus, eating real food rather than drinking juice all day made the cleanse more approachable. At times, eating the raw foods tricked my mind into thinking that I wasn't cleansing at all. The satisfying chia water was an energizing way to start the morning. The cacao truffles were a delicious afternoon snack. But there were some downsides. I still felt hungry for much of the day. I didn't love the salads – they were hard for me to me to finish, which may have contributed to my hunger. There were also so many different bottles and packages that sometimes it was hard to keep track of when I was supposed to eat what. By day three, I was almost craving the simplicity of the standard five-juices-per-day cleanses.<\/p>\r\n\r\n<p><strong>The Takeaway: <\/strong> Next time, I would start with the three-day cleanse and work my way up. Also, if you're a meat eater (like me), I would recommend sticking to a plant-based diet prior to the detox. But overall, I would definitely recommend trying it. If you're looking for a whole-body experience that doesn't just focus on juicing, then DL Revamp is the cleanse for you.<strong>Cost: <\/strong> The three- and five-day plans cost $125\/day. For more information, visit dlrevamp.com.<\/p>\r\n"}