{"id":"Anchors","templateName":"Simple_Collection_Feature_Template4","heading":"Anchors","type":"simple_collections","category":"Features","issue":"March 2015","sourceURL":"article\/2015\/03\/Anchors","previousURL":"article\/2015\/03\/Your_floors_Our_passion","nextURL":"article\/2015\/03\/2015s_Four_Killer_Trends_in_Outdoor_Living","year":"2015","month":"03","subcategory":"FEATURE \/\/ BOAT SHOW","subheading":"Aweigh","authorDetails":"<p><em>By<\/em> Bernard McCormick<\/p>\r\n","summary":"<p>The Palm Beach International Boat Show offers a laid-back, user-friendly experience compared to its counterparts in South Florida.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/simplecollections\/2015\/03\/mainimageboatshowflip.jpg"],"itemscollection":[{"headline":"","description":"<p>If one wonders what the Palm Beach International Boat Show is like, the best preparation is to attend the Fort Lauderdale International Boat Show in October and then expect something very different. The Fort Lauderdale event is the biggest boat show in the world. By necessity, it is highly structured. It sprawls all over the east side of town, in the water and out, and because of the big crowds, it can be hard to access, and limits mobility to whatever venue you choose.<\/p>\r\n\r\n<p>Palm Beach could not be more different. “It's our most user-friendly boat show,” says Andrew Doole, senior vice president of Fort Lauderdale-based Show Management, which organizes both the Fort Lauderdale and Palm Beach shows. “There's all sorts of parking in downtown West Palm Beach, and it is surrounded by great restaurants and bars. You can leave the show and relax for an hour, and walk back in. There are multiple show entrances, so there's not a big crush at any one entrance.”<\/p>\r\n\r\n<p>In its 29th year, the event has gotten on the boat show map in a serious way. It is now third among Florida's boat shows and ranks fifth in the country. This year, it is expected to draw 50,000 people. It not only enjoys a reputation as a pleasant social experience, but, more important to the industry, it is considered a good selling show.<\/p>\r\n\r\n<p>“It's a great selling boat show and also a great social event,” Doole says. “People enjoy strolling the waterfront and seeing the boats. It's a true cross section of people. Some of the wealthiest people live in Palm Beach and they indeed come to the show. Buyers just come across the lake. And there's also a lot of fly in traffic.”<\/p>\r\n\r\n<p>The lake, of course, is Lake Worth, which is technically a lagoon. It runs for 21 miles in northern Palm Beach County. But the action is concentrated in a compact section of Flagler Street just a few blocks long – the downtown waterfront of West Palm.<\/p>\r\n\r\n<p>Although Fort Lauderdale and Palm Beach host far different boat shows, they have a common evolution. Fort Lauderdale's show began in an inland armory. It wasn't until the late Kaye Pearson and his Show Management company took it to the water at the prestigious Bahia Mar in 1977 that the show began its spectacular growth. Likewise, the Palm Beach show began as a combination seafood festival and boat show. It bounced from venue to venue for 10 years. The locations included the Soverel Harbour Marina in Palm Beach Gardens, the Jai-Alai Fronton on 45th Street, the Palm Beach Auditorium, the South Florida Fairgrounds and the Riviera Beach Marina. The show was even canceled one year (in 1990) because of a weak economy.<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Boatshow1.jpg"}]},{"headline":"","description":"<p>Pearson's company took over the management of the Palm Beach Boat Show in 1996. He had Fort Lauderdale as a model and repeated the formula – moving the show to the attractive location on Lake Worth in downtown West Palm Beach. The show was immediately profitable and has flourished over the last decade.<\/p>\r\n\r\n<p>“When we moved to West Palm, that location was a culture leap in quality,” Doole says. “And the location encouraged a lot of participants from our Fort Lauderdale show to exhibit. It has grown from 40 or 50 boats to close to 600 in water, and probably another 250 to 300 on land.”<\/p>\r\n\r\n<p>For those companies located around Palm Beach, the show's growth is particularly satisfying. Michael Mahan, a founding partner of Worth Avenue Yachts, speaks to the local enthusiasm saying that the show has evolved to be one of the most important mega yacht shows in the country.<\/p>\r\n\r\n<p>“It used to be geared toward a local market and now it definitely has an international appeal,” Mahan says. “People like coming to Palm Beach from all over the world and experiencing the Palm Beach atmosphere. Palm Beach is Worth Avenue Yachts' home base, so we really pull out all the stops in setting up an exceptional display and hosting a myriad of exclusive events.” He added that last year, Worth Avenue Yachts had more than 11 boats in the show, ranging in size from 80 feet to 187 feet.<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Boatshow2.jpg"}]},{"headline":"","description":"<p>The show is nicely positioned to attract much of South Florida's boating market. Stuart is an important element of that market, and although it has its own modest show, its leading brokers head to Palm Beach in March. Tom Jenkins, who spent years in Fort Lauderdale before joining the Allied Marine's Stuart office, finds the Palm Beach event to be a respite from shows farther south.<\/p>\r\n\r\n<p>“It's a gentlemen show,” he says. “It's more relaxed. The weather is usually good. It's not as crazy as Miami and Fort Lauderdale. And it's the last big show in Florida. A lot of brokers from Stuart go. There's a good mix of products from small boats up to mega yachts. We bring up a lot of our new boats.”<\/p>\r\n\r\n<p>Among the veteran exhibitors of the Fort Lauderdale show, which have been drawn to the Palm Beach event, is Denison Yachts. The long established Fort Lauderdale company has expanded with a mega yacht division making Palm Beach a natural market.<\/p>\r\n\r\n<p>Denison Yachts first participated in the Palm Beach show in 2006, says Kevin Frawley, Denison's president of business development. “In that time it's gotten a lot bigger. One thing that helps is the timing being at the end of winter. People are still here staying out of the cold, and thinking about buying a boat to use up north.”<\/p>\r\n\r\n<p>The Palm Beach Boat Show also attracts “real buyers” and brings in “bigger boats,” Frawley says. “It's the best selling of all the shows. There are big boats because of the location with all the Palm Beach money ... And Palm Beach buyers are looking more for quality than worrying about price.”<\/p>\r\n\r\n<p>That sentiment prevails among the growing number of exhibitors at the Palm Beach show. As in any business, the bottom line is the bottom line. In this case, that's selling boats.<\/p>\r\n\r\n<p>Plus, it's a bonus when a ringing cash register is accompanied by a heck of a fun party.<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Boatshow3.jpg"}]},{"headline":"","description":"<p>What: 30th annual Palm Beach International Boat Show<\/p>\r\n\r\n<p>When: March 26 to 29<\/p>\r\n\r\n<p>Where: West Palm Beach waterfront, Flagler Drive and Clematis Street<\/p>\r\n\r\n<p>Cost: $20\/gate, $18\/online, $10\/ages 6 to 15, ages 5 and younger free<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Boatshow4.jpg"}]}]}