{"id":"Captain_Planet","templateName":"Interview_Profile_Template1","heading":"Captain Planet","type":"interview","category":"Featured Profiles","issue":"March 2015","sourceURL":"article\/2015\/03\/Captain_Planet","previousURL":"article\/2015\/03\/A_Craft_Connoisseur","nextURL":"article\/2015\/03\/Dining_with_a_View","year":"2015","month":"03","subcategory":"Portrait \/\/ Kyle Michaud","subheading":"Kyle Michaud, a young and innovative Boca-based entrepreneur, created the Green Planet Festival to bring sustainable practices to the everyday South Floridian.","authorDetails":"<p><em>BY <\/em> Tina Ashchian<em>Photography by <\/em> Jason Nuttle<\/p>\r\n","summary":"<p>Kyle Michaud had a dream. \"Then I woke up and started making calls,\" the Boca Raton-based entrepreneur remembers. The vision was of \"a farmers market on steroids,\" an ecofriendly festival that was business-to-consumer oriented. His goal: To create an environment that educates South Floridians on sustainable choices by connecting them with eco-conscious vendors and by introducing them to healthy activities.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/interview\/Kyle-Michaud.jpg"],"description":"<p>In a few short months, that dream became a reality when the first-of-itskind Green Planet Festival even the name came from his dream recently debuted at the Broward County Convention Center. Previously the co-founder of the electronic dance music festival Electric Flurry, Michaud has a history of starting up businesses and a talent for throwing successful inaugural events.<\/p>\r\n\r\n<p>Since he was a child, Michaud always had entrepreneurial tendencies. As a preteen, he sold golf balls and corn. Before he was old enough to own an eBay account, he would sell odd things such as Nextel cell phone antennas and instructions on how to turn your tractor into a four-wheeler. In college, the rugby player sold about 6,000 University of Albany parody T-shirts. This was also where he discovered how much money he could make by throwing huge parties.<\/p>\r\n\r\n<p>The economics major, along with his fraternity friend, decided to host a giant Halloween costume party, selling tickets at $50 each to 3,000 people. After making a five-figure profit at 18 years old, the two continued to book shows 25 to be exact throwing popular Electronic Dance Music (EDM) festivals with DJs like Steve Aoki, Showtek and Adventure Club in the mix of thousands of attendees.<\/p>\r\n\r\n<p>After graduation, and to his mother's dismay, Michaud decided to quit his finance job at General Electric and move to South Beach for opportunities to do bigger shows. He drove down in a cargo van that almost didn't make it with $30 in his pocket, and without knowing a soul. Since then, the 24-year-old has been doing just fine.<\/p>\r\n\r\n<p>He bought a house in a quiet Boca Raton neighborhood after growing tired of the Miami and EDM scene. He then sold his music festival company in April of last year. About four months later, he created the Green Planet Festival, redirecting his energy toward his love for organic foods, yoga, cold-pressed juices and electric cars.<\/p>\r\n\r\n<p>The 12-hour festival which is open to the public and sponsored by popular names like Publix and Fresh Market, showcases organic food, beer and wine, movie screenings, lifestyle workshops, fitness classes, eco-fashion shows, visionary speakers, and samples and shopping from more than 60 ecofriendly local and national businesses.<\/p>\r\n\r\n<p>\"Leaving a zero-carbon footprint is one of the main goals of the festival,\" says Michaud, whose company was rewarded for its efforts in sustainability by the U.S. Green Building Council. Whether the consumer is already an eco-superstar or curious about the lifestyle, Michaud says the mission of the festival is to bridge the community with environmentally sustainable companies, products, ideas and services for awareness and education.<\/p>\r\n\r\n<p>He's planning another Green Planet Festival in South Florida for later this year, but the go-getter isn't stopping there. He plans to add festivals in three other major cities in 2016.<\/p>\r\n"}