{"id":"Designer_Dossier","templateName":"Interview_Profile_Template1","heading":"Designer Dossier","type":"interview","category":"Fashion","issue":"March 2015","sourceURL":"article\/2015\/03\/Designer_Dossier","previousURL":"article\/2015\/03\/Tips_for_Staying_True_To_The_Cleanse_","nextURL":"article\/2015\/03\/Putting_heads_together","year":"2015","month":"03","subcategory":"Style File \/\/ Elie Tahari","subheading":"Elie Tahari","authorDetails":"<p><em>By <\/em> Aly Zofcin<\/p>\r\n","summary":"<p>Elie Tahari came to America, and more specifically to New York City, with less than $100 in his pocket. Today, the designer owns one of the largest fashion houses in New York, and is famous for his elegant and sophisticated designs. We caught up with Tahari at a recent showing at the Polo Club of Boca Raton to talk about his legacy, and his philosophy on designing for all women.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/03\/taharidelman_retouched_fade.jpg"],"description":"<p><strong>Q: What was it like coming to America for the first time? <\/strong> It was “Alice in Wonderland.”<\/p>\r\n\r\n<p><strong>Q: When did you realize you wanted to be a fashion designer? <\/strong> I never thought I would be a fashion designer, I was only thinking about paying the rent. And to pay the rent, you had to make beautiful clothes that people wanted to wear. That's what drove me to design.<\/p>\r\n\r\n<p><strong>Q: What legacy do you hope to leave on the fashion world with your brand? <\/strong> [If we gave] the consumer clothes that have a great fit, great quality and great design, and [if] we made the world a little prettier by doing that, and [if] we made women feel a little happier, and feel better about themselves and more confident, then we did something good.<\/p>\r\n\r\n<p><strong>Q: The way you choose fit models is unique. Can you describe that process, and why you select your models this way? <\/strong> I love to design for real women because that's who wears my clothes. When I am creating the collection, I often fit pieces on women in the office, and always choose to fit on different body types so I can see where the pieces lay on the body and what the fit is like.<\/p>\r\n\r\n<p><strong>Q: What was your inspiration for the womenswear collection? <\/strong> My inspiration for my spring 2015 women's collection was a timeless, chic bohemian woman. The collection focused on materials including leather fringe and laser-cut neoprene appearing to be weathered and sun-bleached.<\/p>\r\n\r\n<p><strong>Q: What celebrity embodies the Elie Tahari woman, and why? <\/strong> I've dressed everyone from Angelina Jolie to Beyoncé and created a handbag collection with Emmy Rossum. I believe that anyone with sophistication and elegance embodies the brand. I've been lucky enough to work with so many amazing women in the past who have looked incredible in my designs.<\/p>\r\n"}