{"id":"Dining_with_a_View","templateName":"Simple_Collection_Feature_Template5","heading":"Dining with a View","type":"simple_collections","category":"Features","issue":"March 2015","sourceURL":"article\/2015\/03\/Dining_with_a_View","previousURL":"article\/2015\/03\/Captain_Planet","nextURL":"article\/2015\/03\/Your_floors_Our_passion","year":"2015","month":"03","subcategory":"Feature \/\/ Waterfront Dining","authorDetails":"<p><em>By<\/em> Heather Carney<\/p>\r\n","summary":"<p>With stunning vistas of the Intracoastal Waterway and the Atlantic Ocean lapping at our heels, there's no shortage of waterfront restaurants in South Florida. Our editorial team narrowed down the list to these 17 can't-miss restaurants from Fort Lauderdale to Boynton Beach that are worth visiting just for the views.<\/p>\r\n","itemscollection":[{"headline":"15th Street Fisheries","description":"<p><strong>The View: The Lauderdale Marina and the Intracoastal Waterway<\/strong><\/p>\r\n\r\n<p>With an outdoor patio and panoramic views of the Intracoastal, 15th Street Fisheries is the ideal spot to impress out-of- town guests. Grab a seat on the patio or reserve a window-front table in the boathouse to watch the endless stream of boats cruise by. After the meal, peer over the dock to catch sight of schools of tarpon and the occasional manatee. Try the pan-roasted black grouper, the citrus grilled salmon or the miso glazed roasted Chilean sea bass.<\/p>\r\n\r\n<p><strong>$$ \/ 1900 SE 15th St., Fort Lauderdale \/ 15streetfisheries.com <\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/FisheriesView02_fade.jpg"}]},{"headline":"Hudson at Waterway East","description":"<p><strong>The View: The Intracoastal Waterway<\/strong><\/p>\r\n\r\n<p>This new restaurant along the Intracoastal in Delray Beach boasts a little bit of everything – stunning waterfront views on the pier, cozy booths and tables inside the restaurant that are elevated to offer views of the water, plus a U-shaped bar that serves craft cocktails. The beautifully plated dishes are a creative fusion of meats, hand-crafted pastas and fresh, daily fish. Favorites include the lobster potato skins, the pretzel encrusted crab cake and the brisket short rib burger.<\/p>\r\n\r\n<p><strong>$$ \/ 900 E. Atlantic Ave., Ste. 22, Delray Beach \/ hudsondelray.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/HUDSONS2.jpg"}]},{"headline":"50 Ocean","description":"<p><strong>The View: Delray Beach and the Atlantic Ocean<\/strong><\/p>\r\n\r\n<p>From the second floor, diners can look out of floor-to-ceiling windows as they dine for lunch, dinner or Sunday brunch. Check out the saltwa- ter fish tank as you enjoy a handcrafted cocktail at the quartz bar. Try the baked grouper topped with blue crab, the mussels, the double stuffed lobster roll or the scallops with pork belly and applejack barbecue sauce.<\/p>\r\n\r\n<p><strong>$$$ \/ 50 S. Ocean Blvd., Delray Beach \/ 50ocean.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/50-Ocean-View.jpg"}]},{"headline":"Beauty & the Feast","description":"<p><strong>The View: Fort Lauderdale Beach<\/strong><\/p>\r\n\r\n<p>A new addition to The Atlantic Hotel &amp; Spa on Fort Lauderdale Beach, Beauty &amp; the Feast offers an unbeatable atmosphere with ocean views, outside seating and a lounge, plus crave-worthy food. Stop in for breakfast, lunch or dinner, or try the weekend brunch for specialty omelets and Benedicts. Don't leave without trying the coconut sorbet and carrot cake. Linger to watch the sunset from the hotel's fifth floor ocean terrace.<\/p>\r\n\r\n<p><strong>$$ \/ 601 N. Fort Lauderdale Beach Blvd., Fort Lauderdale \/ atlantichotelfl.com\/dine-atlantic<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/BeautytheFeast.jpg"}]},{"headline":"Grille 66 & Bar","description":"<p><strong>The View: The Intracoastal Waterway<\/strong><\/p>\r\n\r\n<p>Expect excellence at the Hyatt's steakhouse waterfront restau- rant. Four-star chef Michael Sie- gel serves inspired seafood dish- es, as well as prime 28-day aged beef. The location makes for a great place to spot cruising mega yachts. Try the steaks, the Niman Ranch Pork Chops or the award-winning macadamia nut crusted Chilean sea bass. Stop by the bar from 5 p.m. to 7 p.m. for the daily happy hour that features half-priced potato skins, crabcakes, sirloin sliders and more.<\/p>\r\n\r\n<p><strong>$$$ \/ Hyatt Regency Pier Sixty-Six, 2301 SE 17th St., Fort Lauderdale \/ grille66andbar.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Grille66Bar.jpg"}]},{"headline":"The Pirate Republic Seafood & Grill","description":"<p><strong>The View: The New River<\/strong><\/p>\r\n\r\n<p>The aptly titled restaurant embraces pirate lore with authentic relics, banners and even a pi- rate ship for decoration. But don't let the décor intimidate you – this restaurant knows good food. The Pirate shines with its fresh creative seafood dishes, such as the fire coral shrimp and the fish ceviche, plus its seafood special- ties like the Asopado De Marisco – a bowl of seafood with tomato, green and red bell peppers, garlic, cumin, oregano, wine, brandy and spices tossed with rice. Also try the fish and shrimp vatapa with acaca – a traditional Brazilian dish that takes two days to prepare!<\/p>\r\n\r\n<p><strong>$$ \/ 400 SW Third Ave., Fort Lauderdale \/ piraterepublicbar.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Pirate_Republic-Night.jpg"}]},{"headline":"Blue Moon Fish Co.","description":"<p><strong>The View: The Intracoastal Waterway<\/strong><\/p>\r\n\r\n<p>Just north of Fort Lauderdale, you'll find the picturesque Blue Moon Fish Co. in Lauderdale- by-the-Sea. Boaters can dock their vessel in front of the restaurant and enjoy lunch or, if it's later in the afternoon, order something off of Blue Moon's \"middle menu.\" The restaurant proudly serves local \"day-boat\" fish, and offers dishes with a Flori- da-Louisiana-Cajun flair. Try the Big Easy Seafood Gumbo or the crispy calamari and shrimp for an appetizer, and order the pan-roasted yellowtail snapper for dinner.<\/p>\r\n\r\n<p><strong>$$$ \/ 4405 W. Tradewinds Ave., Lauderdale-by- the-Sea \/ bluemoonfishco.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/BLUE-MOON-FISH-CO.jpg"}]},{"headline":"Banana Boat","description":"<p><strong>The View: The Intracoastal Waterway<\/strong><\/p>\r\n\r\n<p>This restaurant started out in Fort Lauderdale in 1971 and moved its way north to Boynton Beach in 1978. Since then, it's become an \"anchor\" restaurant in the Boynton Beach community, providing unbeatable views of the Intracoastal Waterway from the covered patio deck. The restaurant is known for its authentic Florida food and charm with dishes like conch fritters, Grouper Key Largo and baked tilapia with crabmeat stuffing.<\/p>\r\n\r\n<p><strong>$$ \/ 739 E. Ocean Ave., Boynton Beach \/ bananaboatboynton.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/BANANA-BOAT.jpg"}]},{"headline":"Sea Level Restaurant - Ocean Bar","description":"<p><strong>The View: Fort Lauderdale Beach<\/strong><\/p>\r\n\r\n<p>3030 Ocean comes to mind when you think of dining at the Marriott Harbor Beach Resort &amp; Spa. But don't overlook its sister restaurant, Sea Level, located directly on the beach. The restaurant, which includes a covered patio and a beachside bar, offers a relaxed atmosphere for lounging after a day in the surf and sand. For a light snack or lunch, try the peel and eat edamame, the hummus and pita dip or the jumbo lump crab and arugula salad. The dinner menu offers an array of burgers, grilled steaks and seafood. To end the night right, try the Harbor Beach Tipsy Turtle cocktail – $1 of every sale is donated to the sea turtle conservation fund.<\/p>\r\n\r\n<p><strong>$$ \/ 3030 Holiday Drive, Fort Lauderdale \/ marriott.com\/hotels\/travel\/fllsb-fort- lauderdale-marriott-harbor-beach-resort- and-spa\/<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Bar-and-Rail.jpg"}]},{"headline":"Steak 954","description":"<p><strong>The View: Fort Lauderdale Beach<\/strong><\/p>\r\n\r\n<p>Steak 954 continuously finds its way onto our \"best of\" lists, and we couldn't ignore it for this waterfront restaurant feature either. The high-end steakhouse offers not only exceptional food, but also an exceptional view. And if the ocean doesn't mesmerize, the 15-foot long reef aquarium that's home to jellyfish surely will. Try the raw bar for fresh oysters, shrimp, crab and ceviche. For dinner, try a dry-aged steak with a side of stuffed hash browns. The restaurant also offers breakfast, lunch and, of course, brunch.<\/p>\r\n\r\n<p><strong>$$$$ \/ W Hotel, 401 N. Fort Lauderdale Beach Blvd., Fort Lauderdale \/ steak954.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Steak-954.jpg"}]},{"headline":"Casablanca Cafe","description":"<p><strong>The View: Fort Lauderdale Beach<\/strong><\/p>\r\n\r\n<p>This historic-home-turned-restaurant makes for a romantic dinner on the beach with live entertainment every night. You may have to wait a few minutes to be seat- ed, but it's worth it. Ask for a table on the wraparound porch, or opt for the upstairs dining room with a balcony patio that overlooks A1A and Fort Lauderdale Beach. Try the deep sea linguine or the blue crab crusted mahi mahi. Plus, the sandwiches all come with homemade Parmesan waffle fries. Delicious.<\/p>\r\n\r\n<p><strong>$$$ \/ 3049 Alhambra St., Fort Lauderdale \/ casablancacafeonline.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/CASABLANCA-CAFE2.jpg"}]},{"headline":"Waterstone Bar & Grill","description":"<p><strong>The View: Lake Boca, Intracoastal Waterway, Atlantic Ocean<\/strong><\/p>\r\n\r\n<p>We recently featured Waterstone's sister restaurant, Boca Landing, in our dining section. But Waterstone serves as the more casual, laid-back counterpart. The seafood restaurant at the new Waterstone Resort &amp; Marina, formerly the Boca Raton Bridge Hotel, offers three water views of Lake Boca, the Intracoastal Waterway and the Atlantic Ocean. Enjoy a specialty cocktail while in- dulging in the raw bar. Or make it an evening out with fresh seafood entrées and chef specialties like the Asian ahi tuna salad as you watch the sunset.<\/p>\r\n\r\n<p><strong>$$ \/ 999 E. Camino Real, Boca Raton \/ waterstoneboca.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Waterstone-Bar-Grill.jpg"}]},{"headline":"Lucca","description":"<p><strong>The View: The Intracoastal Waterway<\/strong><\/p>\r\n\r\n<p>With grand ceilings and tall, arched windows showcasing the blue waters of the Intracoastal, Lucca makes for an extravagant dining experience. You'd expect no less at the Boca Raton Resort. The restaurant features an open-arched kitchen, serving Tuscan and Mediterranean cuisine – think citrus marinated olives, eggplant rollatini, lamb sugo and veal osso buco Milanese. The restaurant also boasts an award-winning wine list, and two rooms for private dining.<\/p>\r\n\r\n<p><strong>$$$$ \/ Boca Raton Resort &amp; Club, 501 E. E. Camino Real, Boca Raton \/ bocaresort.com\/dine\/ lucca.html<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Lucca.jpg"}]},{"headline":"Marti's New River Bistro","description":"<p><strong>The View: The New River<\/strong><\/p>\r\n\r\n<p>Planning to catch a play at the Broward Center for the Performing Arts? Now you can enjoy a waterfront meal prior to the show at Marti's New River Bistro. The new restaurant, located at the Center's Huizenga Pavilion, offers indoor and outdoor seating with a prix fixe dinner menu starting 2.5 hours before shows. For $36 per person, diners can enjoy an appetizer, entree and dessert. We suggest the Greek salad and the lobster and shrimp mac and cheese, plus the Key lime pie. Not ready to end the night after the show? On Friday, Saturday and Sunday, the restaurant stays open after performances for drinks, dessert and coffee.<\/p>\r\n\r\n<p><strong>$$$ \/ 201 SW Fifth Ave., Fort Lauderdale \/ browardcenter.org\/visit\/dining\/martis<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/MartisNewRiverBistro.jpg"}]},{"headline":"Caffe Luna Rosa","description":"<p><strong>The View: The Atlantic Ocean<\/strong><\/p>\r\n\r\n<p>Many waterfront restaurants serve your typical tropical cocktails and fried food. Not Caffe Luna Rosa. The Delray Beach restaurant offers authentic Italian dining with a stunning oceanfront view. The perfect date night? We'd say so. The chefs roast their own coffee beans, bake their own breads and prepare fresh pasta in-house daily. Try the scallopini di vitello alla marsala or the Florida yellowtail snapper Francese.<\/p>\r\n\r\n<p><strong>$$ \/ 34 S. Ocean Blvd., Delray Beach \/ caffelunarosa.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/CaffeLunaRosa.jpg"}]},{"headline":"Coconuts","description":"<p><strong>The View: Canal on the Intracoastal<\/strong><\/p>\r\n\r\n<p>We love the Foxy Brown and the Red Cow, but Coconuts might be our favorite restaurant from the Be Nice Restaurants group. The Fort Lauderdale staple is situated just steps from Fort Lauderdale Beach and offers comfort dishes like coconut shrimp, a to-die-for lobster roll and a blackened or grilled mahi sandwich. A must-try dish is the \"Comfort Bowl\" with lobster – a creamy mix of pasta shells, sriracha cheese sauce and lobster. Yum.<\/p>\r\n\r\n<p><strong>$$ \/ 429 Seabreeze Blvd., Fort Lauderdale \/ coconutsfortlauderdale.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/MG_8908.jpg"}]},{"headline":"Southport Raw Bar","description":"<p><strong>The View: Canal on the Intracoastal<\/strong><\/p>\r\n\r\n<p>This dockside restaurant is tucked into a side street off of 17th Street in Fort Lauder- dale. It doesn't look like much from the outside, but walk to the back patio and it's full of life. The restaurant – a favorite with locals – backs up to a canal that opens into the Intracoastal. It's a great spot for an afternoon beer (or two) while snacking on fish tacos, oysters and fresh steamed mussels.<\/p>\r\n\r\n<p><strong>$$ \/ 1536 Cordova Road, Fort Lauderdale \/ southportrawbar.com<\/strong><\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/SOUTHPORT-RAW-BAR.jpg"}]},{"headline":"9 Other Waterfront restaurants to try","description":"<p><strong>Aruba Beach Cafe<\/strong><\/p>\r\n\r\n<p>1 Commercial Blvd., Lauderdale-by-the-Sea \/ arubabeachcafe.com<\/p>\r\n\r\n<p><strong>JB's on the Beach <\/strong><\/p>\r\n\r\n<p>300 NE 21st Ave., Deerfield Beach \/ jbson- thebeach.com<\/p>\r\n\r\n<p><strong>Kaluz<\/strong><\/p>\r\n\r\n<p>3300 E. Commercial Blvd., Fort Lauderdale \/ kaluzrestaurant.com<\/p>\r\n\r\n<p><strong>Le Tub<\/strong><\/p>\r\n\r\n<p>1100 N. Ocean Drive, Hollywood \/ theletub.com<\/p>\r\n\r\n<p><strong>Ocean2000<\/strong><\/p>\r\n\r\n<p>2000 N. Ocean Blvd., Fort Lauderdale \/ pelicanbeach.com\/ocean2000.aspx<\/p>\r\n\r\n<p><strong>Rustic Inn Crabhouse<\/strong><\/p>\r\n\r\n<p>4331 Ravenswood Road, Fort Lauderdale \/ arkrestaurants.com\/rustic-inn-fort-lauder- dale\/<\/p>\r\n\r\n<p><strong>The Village Grille<\/strong><\/p>\r\n\r\n<p>4404 El Mar Drive, Lauderdale-by-the-Sea \/ villagegrille.com<\/p>\r\n\r\n<p><strong>Two Georges<\/strong><\/p>\r\n\r\n<p>1754 SE Third Court, Deerfield Beach and 728 Casa Loma Blvd., Boynton Beach \/ two- georgesrestaurant.com<\/p>\r\n\r\n<p><strong>Via Luna<\/strong><\/p>\r\n\r\n<p>The Ritz-Carlton, Fort Lauderdale, 1 N. Fort Lauderdale Beach Blvd., Fort Lauderdale \/ ritzcarlton.com<\/p>\r\n","imageorvideo":[]}]}