{"id":"Holding_Court","templateName":"Interview_Template2","heading":"Holding Court","type":"interview","category":"Nomad's Notebook","issue":"March 2015","sourceURL":"article\/2015\/03\/Holding_Court","previousURL":"article\/2015\/03\/5_Spring_Breakaways","nextURL":"article\/2015\/03\/A_Craft_Connoisseur","year":"2015","month":"03","subcategory":"NOMAD'S NOTEBOOK \/\/ The Brazilian CourT","subheading":"The Brazilian Court Hotel in Palm Beach provides the ideal setting for a day of catching up with good friends.","authorDetails":"<p><em>By <\/em> Gloria Stuart<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/03\/Holdingcourt.jpg"],"description":"<p>Life is so busy these days. It's definitely easier to stay in touch with friends through social media, but for those special people in your life, replenishing the relationship with a face-to-face connection is a must. But it can be difficult to find a place and time with no distractions.<\/p>\r\n\r\n<p>For an instant remedy, take time to indulge in a \"girls' day out,\" or as I have coined it, \"GDO.\" Palm Beach's The Brazilian Court Hotel provided the ideal venue for our respite: lunch al fresco at Café Boulud in the lushly landscaped tropical courtyard where renowned Michelin- starred chef Daniel Boulud creates his gourmet concoctions. We shared a platter of fresh oysters, and I opted for the Maine lobster roll for my main course. His dishes provide the perfect symmetry for dearest friends reminiscing about past adventures, pontificating on our lives' future directions, and of course, dishing a good dose of gossip.<\/p>\r\n\r\n<p>On the fringe of Worth Avenue, The Brazilian Court has proved to be a discreet enclave for the rich and famous for decades. Its allure has attracted celebrities throughout the years including Marlon Brando, Greta Garbo, the Kennedys and the Pulitzers, just to name a few. At the epicenter of Palm Beach society, The Brazilian Court, which was built in 1926, is known for its privacy and discretion. Rosario Candela, a famous New York architect who designed The Brazilian Court, broke the traditional style showcased by Palm Beach architect Addison Mizner. Candela used a Mediterranean design, and developed a simple courtyard that empha- sized the inner face of the building rather than the street façade. The architect envisioned a place with simple elegance and old-world glamour that still encompasses Palm Beach style today.<\/p>\r\n\r\n<p>Although we didn't spend the night, The Brazilian Court's 80 guestrooms and suites are spacious and uniquely decorated, featuring mahogany millwork and imported fabrics. The design creates a warm, home-like ambience. For added charm, the Hotel uses real door keys – not the ubiquitous plastic cards. Private terraces and an art gallery line the corridors. The Café Boulud restaurant features the work of artist Mark Bowles.<\/p>\r\n\r\n<p>After our lunch, we treated ourselves to a fabulous facial by Elle Glass at The Brazilian Court's Frederic Fekkai Salon &amp; Spa. The sooth- ing treatment renewed our senses. The treat- ment included Chante- caille skincare, a family owned business known for products that use cutting-edge nanotech- nology, and finished with a nano-gold mois- turizer that contained 24kt gold – talk about glowing skin. The facial concluded with a neck and shoulder massage, leaving us relaxed and rejuvenated.<\/p>\r\n\r\n<p><strong>IF YOU GO<\/strong><\/p>\r\n\r\n<p><strong>Try The Brazilian Court Beach<\/strong><\/p>\r\n\r\n<p><strong>Experience: <\/strong> Take a break from shopping and be whisked away to the beach by The Brazilian Courts' luxurious BMW sedan. Upon your arrival, a hotel representative will set up your beach chair and um- brella, and have at the ready your personal beach bag stocked with towels, bottled waters, reading materials and sunscreen.<\/p>\r\n\r\n<p><strong>Book The Brazilian Court pet package: <\/strong> The Hotel's warm welcome is also extended to pets. Your pampered pet will enjoy a complimentary amenity, nightly turndown service and town car service to visit Pucci &amp; Catana Luxury Pet Boutique.<\/p>\r\n"}