{"id":"March_2015_McCormick_Place","templateName":"McCormick_Place","heading":"March 2015 McCormick Place","type":"interview","category":"McCormick Place","issue":"March 2015","sourceURL":"article\/2015\/03\/March_2015_McCormick_Place","previousURL":"article\/2015\/03\/concours_delegance_event","nextURL":"2015\/03\/index.php","year":"2015","month":"03","authorDetails":"<p><em>By<\/em> Bernard McCormick<\/p>\r\n","summary":"<p>Fort Lauderdale's seven miles of shoreline and 165 miles of inland waterways, coupled with its flat topography and dense development make it susceptible to erosion, coastal flooding, storm surge and high tides. A recent neighbor survey and communitywide visioning initiative revealed that residents are experiencing more frequent flooding in their neighborhoods, and have a greater sense of urgency to address the growing hazard. The neighbor directive prompted the City to revolutionize its operations by adopting a strategic approach that proactively considers changing climate conditions when planning for the future.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/03\/bernardmccormickfeb2015.jpg"],"description":"<p>The above is from a City of Fort Lauderdale news release, hot off the presses, touting a new program to reduce flooding. Note that it mentions \"dense development\" as one of the causes of the problem. Isn't it rich that the city is addressing this serious problem at the very time that it is making it worse by permitting an explosion of development in the same neighborhoods it is trying to protect?<\/p>\r\n\r\n<p>When a priest from the pulpit congratulates visitors for braving South Florida's traffic jams to get to church, you know we have a problem. We are hearing it on all sides.<\/p>\r\n\r\n<p>\"Name anybody who isn't upset about all this new construction going on downtown,\" we said to a friend who is involved in the building industry.<\/p>\r\n\r\n<p>\"Restaurants across the street from the new buildings,\" he replied. \"And the people renting or buying those new units.\"<\/p>\r\n\r\n<p>Touché. Except those restaurant owners won't be so happy when they leave their parking lots and traffic is so heavy that they have to turn right to go left. This is already a problem with downtown offices – when you have to go around the block, or several blocks just to head in the desired direction. Or they are late heading to the airport, and a trip that should take 10 minutes turns out to be 25. It is obvious that Fort Lauderdale is controlled by development forces, and in their desire to make money, they are threatening the quality of life that attracts people to the city in the first place.<\/p>\r\n\r\n<p>Our consciousness of this overdevelopment is not heightened just by people everywhere bitching about it; researching the past in preparation for our magazine's 50th anniversary in April reminds us of a time when Fort Lauderdale and nearby cities' downtowns were stagnant – when Las Olas Boulevard had darkened, empty storefronts, and when an effort to revitalize the downtown stalled to the point that the Downtown Development Authority resorted to building tennis courts on property slated for new buildings, just to make it appear something was happening.<\/p>\r\n\r\n<p>Well, those new buildings came, and came again, and now the trend is spreading to what were once small businesses along Federal Highway. Some of those streets were seedy, and the revival is welcome. But do we need 32 stories where half that size is already too dense for comfort?<\/p>\r\n\r\n<p>Unlike many places, Fort Lauderdale's charm is that the neighborhoods immediately surrounding downtown – Victoria Park, Rio Vista, Colee Hammock – are among the best places to live in South Florida. But those are the residents being affected as cranes poke into the sky like giant birds. Their quiet streets become less so as people cut through, just trying to move around. Not to mention flooding and beach erosion.<\/p>\r\n\r\n<p>Some, whose wallets are fattened by the sounds of pile drivers, will argue that you can't stop progress. No? Have they heard of Stuart and Vero Beach? Both are filled with people who once lived farther south in a gentler, less crowded time. And they don't live in 32-story buildings. Which is why they moved there.<\/p>\r\n\r\n<p>The media in Broward County has been strangely silent on this subject, even if the citizens are not. It is a different story in Palm Beach County. The Palm Beach Post has been filled with stories of angry residents in the western part of the county fighting efforts of developers to break down the guidelines preserving large areas for open space. The basic argument is that people bought there on the sales pitch that they were getting away from the bustle of the coastal regions, enjoying the warmth and charm of an old Florida that would not succumb to growth pressures. Communities such as Wellington were founded on the premise that they would remain essentially rural. Wellington has, but not without its share of controversy, but other nearby areas are under pressure to lose their open space character.<\/p>\r\n\r\n<p>There is nothing new in this story. Going back to the 1970s, Boca Raton passed a density cap in an effort not to become another Fort Lauderdale with a beach of high rises. The courts ultimately overturned it, but it gave time for the city to plan its future.<\/p>\r\n\r\n<p>It was the same time when Stuart and Vero Beach put the brakes on building. Today they enjoy the fruits of prudence.<\/p>\r\n"}