{"id":"Putting_heads_together","templateName":"Interview_Template2","heading":"Putting heads together","type":"interview","category":"Shop Talk","issue":"March 2015","sourceURL":"article\/2015\/03\/Putting_heads_together","previousURL":"article\/2015\/03\/Designer_Dossier","nextURL":"article\/2015\/03\/Take_a_lunch_break_at_Green_Bar_Kitchen_or_Try_ouT_This_recipe_From_The_chef","year":"2015","month":"03","subcategory":"SHOP TALK \/\/ Coworking","subheading":"Fort Lauderdale's newest coworking facility provides members with more than just a desk space.","authorDetails":"<p><em>By <\/em> Alyssa Morlacci<\/p>\r\n","summary":"<p>Axis Space Coworking, 333 Las Olas Way, Fort Lauderdale \/ axisspace.com<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/03\/Puttingheadstogether.jpg"],"description":"<p>Foam and artificial grass walls, nap rooms and a snack bar - Axis Space, situated on the first, second and fourth floors of the Las Olas River House, is the Chuck E. Cheese for adults. Truly - its mission is to stimulate creative, imaginative thinking through interactions and shared working environments with people from varying fields.<\/p>\r\n\r\n<p>The coworking concept began a decade ago when Brad Neuberg, a computer programmer in San Francisco, decided he wanted to work as a freelancer, but he also wanted to belong to a community. So, he coined the term \"coworking\" and rented an office space he could share with other professionals.<\/p>\r\n\r\n<p>Since, coworking spaces have been popping up across the U.S., offering more than just a desk and some company. Fort Lauderdale's newest coworking facility provides conference rooms, mailboxes, and access to the building's gym and rooftop pool. One of Axis Space's greatest features is its scenic view of the Intracostal through ceiling-high windows. Co-founder Sebastian Vela says the windows were important to the design because natural light stimulates thinking.<\/p>\r\n\r\n<p>Sebastian Vela's father, Jairo Vela, was the main architect who designed the space. Now, he works from the \"bubbles and clouds,\" or office spaces boxed in by transparent, glass walls on the fourth floor. Sebastian Vela prefers to work on the first floor, which is inhabited by \"openground members\" with no walled-off offices, but instead long tables and chairs that allow for interaction.<\/p>\r\n\r\n<p>\"Coworking space is an opportunity for everyone who has a business, works from home, a startup, to be in a place where you're surrounded by people who are like-minded,\" he says.<\/p>\r\n\r\n<p>Membership costs run from $100-$900 per month. The company also offers a \"green membership,\" which allows members who travel to Axis Space on a water taxi, bike, trolley or other alternative means of transportation, to receive a monthly discount.<\/p>\r\n"}