{"id":"The_Guide_To","templateName":"Simple_Collection_Template1","heading":"The Guide To","type":"simple_collections","category":"Things To Do","issue":"March 2015","sourceURL":"article\/2015\/03\/The_Guide_To","previousURL":"article\/2015\/03\/Design_NS","nextURL":"article\/2015\/03\/A_Detox_Challenge","year":"2015","month":"03","subheading":"March","authorDetails":"<p><em>By<\/em> <a href=\"http:\/\/www.gulfstreammediagroup.com\" target=\"_blank\">http:\/\/www.gulfstreammediagroup.com<\/a><\/p>\r\n","summary":"<p>What to do, see and lust over this month.<\/p>\r\n","itemscollection":[{"headline":"10 days of art","description":"<p>Experience an exciting, multi-day cultural arts event that will be fun for the entire family. Featuring the finest in classical music, jazz, art, film and literature, the Festival of the Arts BOCA kicks off March 6 and contin- ues through March 15 (Ticket prices vary, festivaloftheartsboca.org).<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/10-Days-of-Art.jpg"}]},{"headline":"Boca Bacchanal","description":"<p>Indulge in a weekend filled with fabu- lous food and delicious wine. From March 27 to 28, the celebration will offer the best local cuisine and drink from 30-plus restaurants. Attendees will enjoy fine wine tastings, a craft beer garden, chef demonstrations and much more (Ticket prices vary, bocabacchanal.com).<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Boca-Bacchanal.jpg"}]},{"headline":"A Tribute Performance","description":"<p>Grammy and Emmy award-winning Music Di- rector and Principal Conductor Lee Musiker presents “One Singular Sensation: A Tribute to the Music of Marvin Hamlisch.” The show will feature Donna McKechnie, Jodi Benson and Doug LaBrecque during its debut at the Boca Raton Community Church March 7 (palmbeachpops.org).<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/A-Tribute-Performance.jpg"}]},{"headline":"Latin Serenade","description":"<p>Florida Atlantic University's Latin Vocal Ensemble will captivate audiences on March 12, performing at the Bonnet House Museum &amp; Gardens in Fort Lauderdale. The event includes com- plimentary wine, dessert and coffee during an enjoyable evening under the stars (Ticket prices vary, bonne- thouse.org\/music-series).<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Latin-Serenade.jpg"}]},{"headline":"Bacon and BourBon","description":"<p>At the heart of Delray Beach, enjoy a bacon-filled weekend paired with an eclectic array of Ameri- can bourbons on March 28 and 29. This culinary event not only matches the flavors of well-aged bourbon with a wide-ranging menu of bacon and pork related dishes, but it also includes tastings, seminars and live music for a delectable night out (Tickets from $25, delraybaconandbourbonfest.com).<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/BaconandBourbon.jpg"}]},{"headline":"Saint Patty'S Parade","description":"<p>You don't need to be Irish to enjoy this St. Patrick's Day tradition. On March 14, the Fort Lauderdale St. Patrick's Parade and Festival marches into downtown. The celebration of all things Irish includes live music, great food, cultural exhibits, Irish dancers and so much more (Free, ftlaudirishfest.com).<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/Saint-Pattys-Parade.jpg"}]},{"headline":"Night with Stars","description":"<p>Enjoy a special evening at the ballet. For one night only on March 7, stars from New York City Ballet and Pacific Northwest Ballet will delight audience members with top-notch artistry and choreography rarely seen outside of New York's Lincoln Center ($50, boca- ballet.org).<\/p>\r\n","imageorvideo":[{"file":"projectflipadmin\/sites\/default\/files\/simple_collection_files\/2015\/03\/A-Night-with-Stars.jpg"}]}]}