{"id":"Tips_for_Staying_True_To_The_Cleanse_","templateName":"Interview_Template3","heading":"Tips for Staying True To The Cleanse. ","type":"interview","category":"Health & Fitness","issue":"March 2015","sourceURL":"article\/2015\/03\/Tips_for_Staying_True_To_The_Cleanse_","previousURL":"article\/2015\/03\/Ocean_Blue_Yacht_Sales","nextURL":"article\/2015\/03\/Designer_Dossier","year":"2015","month":"03","subcategory":"BALANCE \/\/ HEALTH & FITNESS","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/03\/Citrus_Arrangement.jpg"],"description":"<p><strong>Cleanse Dos: <\/strong><\/p>\r\n\r\n<ul>\r\n\t<li>Take advantage of nutritional consultations prior to the cleanse.<\/li>\r\n\t<li>Eat light, vegan foods before and after your cleanse to ease in and out of the cleanse. Avoid gluten and processed foods.<\/li>\r\n\t<li>Only choose organic food and juices, other- wise you will be putting toxins and pesticides back into your body.<\/li>\r\n\t<li>If you are very hungry, have a green apple or a handful of organic hemp seeds. Remember you are doing this cleanse because you love your body, so listen to it.<\/li>\r\n\t<li>Drink lots of water – aim for 8 to 10 glasses per day. Plain hot water (just like you drink hot tea) is best. Sip on it throughout the day. It will help eliminate bloating and headaches.<\/li>\r\n\t<li>To maintain results, continue with clean, plant-based foods as long as you can on your own.<\/li>\r\n\t<li>If desired, do light exercise such as walking.<\/li>\r\n<\/ul>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<p><strong>Cleanse Don'ts: <\/strong><\/p>\r\n\r\n<ul>\r\n\t<li>Don't eat heavy foods such as bread and animal proteins right before and right after the cleanse.<\/li>\r\n\t<li>Don't use the cleanse as a quick fix – it is a reboot for the system and not a crash diet.<\/li>\r\n\t<li>Don't pressure yourself into doing a long cleanse if you are not ready.<\/li>\r\n\t<li>Avoid strenuous workouts. Your body needs to focus on cleansing instead of building muscle.<\/li>\r\n<\/ul>\r\n\r\n<p>&nbsp;<\/p>\r\n"}