{"id":"Whats_stayed_and_whats_gone","templateName":"Publisher_Letter","heading":"What's stayed and what's gone...","type":"interview","category":"Publisher's Letter","issue":"March 2015","sourceURL":"article\/2015\/03\/Whats_stayed_and_whats_gone","previousURL":"article\/2015\/03\/YELPIES","nextURL":"article\/2015\/03\/Design_NS","year":"2015","month":"03","subcategory":"Bernard mcCormick","subheading":"What Will definitely be Around - barring the end of time - Will be the Waterways. ","summary":"<p>As we approach our 50th anniversary celebration next month, we are conscious of all the things that aren't here anymore. Especially restaurants. We have never understood why successful restaurants don't last forever. Obviously, founding owners depart life, but there is usually a family member, or a loyal and experienced employee, who can take over and keep a good thing going. But there are just not many like Miami's historic Joe's Stone Crab, which traces its history to 1913.<\/p>\r\n","images":["projectflipadmin\/sites\/default\/files\/articles\/2015\/03\/PubletterJan.jpg"],"description":"<p>As we look over this issue's best waterfront restaurants, a section organized by Managing Editor Heather Carney, we can find only one that was here when we arrived in 1970, five years after this magazine was launched. And ac- cording to its website, Fort Lauderdale's South- port Raw Bar was not known by that name until the early 70s, although another restaurant was already in place at the location on the end of a canal near 15th Street. Our kids grew up at the Southport, and now, we occasionally drop in for lunch. Our initial attraction was one of the best Philly cheese steaks in South Florida, although one of the original owners, Carmine (restaurant owners never have last names), was always quick to point out that his New York pork sandwich was his personal favorite.<\/p>\r\n\r\n<p>Some of the others on our list have legs. Coconuts, 15th St. Fisheries and Blue Moon Fish Company have some mileage, but none comes close to 50 years. The locations are a dif- ferent matter. Some of the prime spots on the Intracoastal and major arteries have undergone several ownerships and names. Back in the 70s, Intracoastal Waterway locations near major streets were favored by some of the most popu- lar restaurants. There was Leonce Picot's Down Under on Oakland Park Boulevard. Across the street, Yesterday's had a faithful following.<\/p>\r\n\r\n<p>Commercial Boulevard had Stan's Lounge, a bit more casual but always busy. Frankie's on the Intracoastal in the Galt Ocean Mile area was a good Italian spot. Boca Raton had one of the most atmospheric places in The Bayou on a canal off the Intracoastal. Its all-black wait staff was unique in South Florida. Now, all these res- taurants belong to the ages.<\/p>\r\n\r\n<p>Waterfront dining has hardly gone away, however, as this issue illustrates. It will be in- teresting to see how many featured in this issue will be around 50 years from now.<\/p>\r\n\r\n<p>What will definitely be around – barring the end of the world – will be the waterways, which lead to the restaurants. Boating has never been bigger, nor have boat shows. It wasn't un- til 1977 that the late Kaye Pearson took over a struggling Fort Lauderdale show and made it successful by doing something that should have been obvious – he moved it to a water location at Bahia Mar.<\/p>\r\n\r\n<p>Twenty years later, his company repeated that gesture in West Palm Beach, and the Palm Beach International Boat Show has earned a spe- cial spot in the hearts of the nautical set. We trace that history in a special section on page 66.<\/p>\r\n\r\n<p><img class=\"nowrap\" src=\"\/projectflip-frontend\/projectflipadmin\/sites\/default\/files\/articles\/description\/images\/signature_0.jpg\" \/><\/p>\r\n"}