{"id":"Whats_New_Under_the_Sun","templateName":"Ideas_Template1","heading":"What's New Under the Sun","type":"photo_essay","category":"Ideas","issue":"March 2015","sourceURL":"article\/2015\/03\/Whats_New_Under_the_Sun","previousURL":"article\/2015\/03\/The_Perfect_Match_Polo_and_Brunch","nextURL":"article\/2015\/03\/Exhibition_Premiere","year":"2015","month":"03","subcategory":"Eat. Play. Love.","authorDetails":"<p><em>By <\/em> Merri Grace McLeroy<\/p>\r\n","description":"<p>While there were no earth-shattering new technological rollouts for 2015 at the International Casual Furniture &amp; Accessories Market, there were sophisticated refinements in nearly every showroom. Even the most utilitarian outdoor furnishings appearing in stores and showrooms this year will be ergonomically comfortable, durable, low maintenance and elegantly appointed.<\/p>\r\n","photoCollection":[{"caption":"Stand-up or bar height dining remains a popular choice. This bare teak Angela Adams by Weatherend Round Pedestal Table and Seal Cove Standup Chairs will weather to a silvery gray. Additional painted and wood finishes are available. The table is also sold in cocktail, dining and stand-up heights with a wood, glass or granite top. Available to the trade through the Janus et Cie Showroom at DCOTA in Dania Beach. ","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/Weatherend_angelaadamsTable-lg.jpg"}]},{"caption":"Super-sized dining tables like Barlow Tyrie’s Equinox Ceramic Top Extend- ing Table, a Design Excellence Award Winner, are well-suited for large out- door dinner parties. Available at Casa Furnishings in Coral Gables, Clima Outdoor Collections in Miami and  Living Alfresco in South Miami.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/Barlow-Tyrie_-Equinox-Ceramic-Top-extending-table.jpg"}]},{"caption":"Sectional seating allows for more flexible design options, like the contemporary Nova Collection designed by  Matthias Hoffman in Lloyd Loom for Lloyd Flanders. Available at Patio Furniture Warehouse in Hallandale Beach, Island Living & Patio in West Palm Beach and all Carls Patio locations.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/LF_Nova23.jpg"}]},{"caption":"This Pride Bellanova 108-inch rectangular firepit dining table (firepit included) is shown with the artisan cast aluminum table top and is available in seven cast aluminum top varia- tions. Visit Castelle.PrideFamilyBrands.com for retailers throughout South Florida.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/PFB-bellanova-Cushion-Dining_Sm.jpg"}]},{"caption":"Resortful design emulates the luxurious resort lifestyle as in Design Excellence Award Winner, Tuuci’s Vineyard Shade Pod which features four shades mounted on one mast that is also designed to accommodate Tuuci’s new LED lights and mounted heaters. Visit Tuuci.com\/contact for retailers and showrooms.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/TUCCI--Vineyard-Shade-Pod-1.jpg"}]},{"caption":"Playful finishes, frames and fabrics cre- ate a focal point in outdoor spaces. Brown Jordan’s classic Tamiami chair in five new, bright colors was a show favorite. Available at Sklar Furnishings in Boca Raton, Patio & Things in Coral Gables, Clima Outdoor Col- lections in Miami and Island Living & Patio in West Palm Beach.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/Brown-Jordan---Tamiami-5Brights.jpg"}]},{"caption":"Integration of elements, as with the Tuuci Vine- yard Shade Pod (above left) and Mamagreen’s OKO Double Sun Lounger with tray and shade allow clean styling and hassle-free comfort.  The Sun Lounger is available at Clima Outdoor Collections in Miami.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/2ff080dc-6c0f-4b1c-80bd-b93e7d06beda_127-1.jpg"}]},{"caption":"Sophisticated color and pattern prevail as exemplified beautifully in Mamagreen’s stripe collection inspired by Navajo textiles. The company’s adventurous color schemes first caught our eye in 2012. Now the industry is ablaze with candied multi-colors. Available at Clima Outdoor Collections in Miami.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/MAMAGREEN-STRIPE-dining-chair.jpg"}]},{"caption":"Popular outdoor amenities include kitchens, fireplaces and sculp- tures. Add to that list a beautiful shower feature. Not designed to be hidden, this MGS CB406 is a stunning floor-fitted shower ideal for both indoor and outdoor use. Available at Bathrooms Unique in Coral Gables, Designer’s Plumbing in Miami and Miller’s Elegant Hardware in Jupiter and Miami.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/MGS-Shower_CB406_AMB_02.jpg"}]},{"caption":"Granite is making a big entry into tabletops. The Colonial Pub Table from Outdoor Greatroom tops granite with glass for a flawless reflective surface and a stainless-steel and crystal gas burner with an optional glass wind guard. Available at Berry Patio in Davie, Home Furniture and Patio in Miami Beach, and Evening De-Light Fireplaces in Davie and Miami.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/Outdoor-GRTRM_ColonialPub_Granite_Glass.jpg"}]},{"caption":"Sculptural fountains like this carved granite Helix Fountain from Stone Forest provide a soothing respite. Available at Allied Kitchen & Bath in Fort Lauderdale; Far- rey’s Wholesale Hardware in North Miami; Dwellings Design Center in Vero Beach; Coral Gables Plumb- ing, Decorators Plumbing and Designer’s Plumbing & Hardware in Miami; and Ferguson in Boca Raton, Fort Lauderdale and West Palm Beach.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/Stone-Forest_Helix-Fountain.jpg"}]},{"caption":"Ambient lighting becomes more easily attain- able with portable gel or bio-fuel fire pits or bowls like the Serenity with Venturi Flame Gel, shown here by The Outdoor Greatroom Com- pany. Available at Berry Patio in Davie, Home Furniture and Patio in Miami Beach, and Eve- ning De-Light Fireplaces in Davie and Miami.","websiteUrls":[],"images":[{"file":"projectflipadmin\/sites\/default\/files\/photo_essay_images\/2015\/03\/Venturi_Serenity_Flame3.jpg"}]}]}